[{"utc_offset":7200000,"venue":{"country":"fr","localized_country_name":"France","city":"Toulouse","address_1":"7 Avenue Parmentier  31200 Toulouse","name":"Ecole d'informatique SupInfo","lon":1.429574,"id":7072632,"lat":43.614071,"repinned":false},"rsvp_limit":60,"headcount":43,"visibility":"public","waitlist_count":0,"created":1336377107000,"rating":{"count":6,"average":4.170000076293945},"maybe_rsvp_count":0,"description":"<p>La première session du Toulouse Mobility User Group est enfin programmée. Elle aura pour objectif de lancer le mouvement de promotion des acteurs toulousains autour des technologies informatiques de la mobilité.</p> <p>A cette occasion, le Toulouse Mobility User Group s'associe au lancement des OpenLabs de l'école d'informatique SupInfo.</p> <p> </p> <p>Pour cette session, le sponsor sera la société LevelUp Studio.</p> <p><a href=\"http://photos4.meetupstatic.com/photos/event/8/4/1/4/event_117393812.jpegBasée\" class=\"linkified\">http://photos4.meetupstatic.com/photos/event/8/4/1/4/event_117393812.jpegBasée</a> à Toulouse, en France, LevelUp Studio est une société avec des idées innovantes et une conception amenant ses applications à devenir les plus grands noms du Google Play Store. Notre expérience en tant que développeurs nous permet de parfaitement maitriser les plateformes mobiles, et de nous assurer que nos produits sont les meilleurs dans leur catégorie et répondent aux exigeantes grandissantes des utilisateurs.</p> <p>Applications :</p> <p>- <a href=\"https://play.google.com/store/apps/details?id=com.levelup.beautifulwidgets\">Beautiful Widgets</a></p> <p><a href=\"https://play.google.com/store/apps/details?id=com.levelup.beautifulwidgets\">&lt;/a&gt;- P&lt;a href=\"https://play.google.com/store/apps/details?id=com.levelup.touiteur\"&gt;lume for Twitter</a></p> <p><a href=\"https://play.google.com/store/apps/details?id=com.levelup.touiteur\">&lt;/a&gt;- Peti (à venir)</p> <p>&lt;a href=\"https://play.google.com/store/apps/details?id=com.levelup.beautifulwidgets\"&gt;</a></p> <p><a href=\"https://play.google.com/store/apps/details?id=com.levelup.touiteur\">&lt;/a&gt;</p> <p>Site web : &lt;a href=\"http://levelupstudio.com/\"&gt;<a href=\"http://levelupstudio.com/\" class=\"linkified\">http://levelupstudio.com/</a></a></p> <p> </p> <p>Pour cette session, nous serons accueillis par l'école d'ingénieur d'informatique SupInfo.</p> <p><b>SUPINFO</b> est une école supérieure privée d'informatique fondée en 1965. L'établissement a pour but de former des experts en technologies de l'information et de la communication (TIC). L'école est reconnue par l'État français, elle délivre un titre d’<i>Expert en informatique et systèmes d’information</i> enregistré au Répertoire national des certifications professionnelles au niveau I (bac+5).</p> <p>Le campus de Toulouse, situé au 7 avenue Parmentier (31200 – Métro Canal du Midi), compte aujourd'hui environ 198 étudiants. Fort de son dynamisme, SUPINFO Toulouse crée de nombreux partenariats avec des entreprises (SSII, industries…) et organise des conférences à la pointe de la technologie pour ses étudiants et ses partenaires.</p> <p>Site web : <a href=\"http://www.supinfo.com/toulouse/\"><a href=\"http://www.supinfo.com/toulouse/\" class=\"linkified\">http://www.supinfo.com/toulouse/</a></a></p> <p> </p> <p>Au niveau du programme, 2 conférences vous seront proposées.</p> <p><b>Conseils ergonomiques pour les développement d'applications natives pour smartphones et tablettes.</b><br/>Assuré par la société Phonitive.<br/><a href=\"http://photos3.meetupstatic.com/photos/event/8/6/9/4/event_117394452.jpegFondée\" class=\"linkified\">http://photos3.meetupstatic.com/photos/event/8/6/9/4/event_117394452.jpegFondée</a> à Toulouse en Mai 2009, aujourd’hui experte dans l’ingénierie mobile, pointure dans le développement iPhone et iPad, Phonitive crée, édite et intègre des solutions innovantes pour smartphones et écrans tactiles. Jeune et dynamique, en pleine croissance, notre entreprise est consacrée à l’innovation et la créativité. Phonitive a remporté le prix Cre’acc 2009 Midi-Pyrénées dans la catégorie « création innovante ».<br/>Au mois d’avril 2010 Phonitive a intégré la pépinière d’entreprises innovantes Prologue 1 à Labège.<br/>Site web : <a href=\"http://www.phonitive.fr/\"><a href=\"http://www.phonitive.fr\" class=\"linkified\">http://www.phonitive.fr</a><br/></a> <b>Présentation de Unity, moteur de jeux vidéos 3D multi-plateforme.</b><br/>Assuré par la société LevelUp Studio<br/>La conférence sera réalisée par Robin Picou et Basile Fabre.  </p> <p>A la fin des conférences, vous serez invités à participer à une collation informelle avec les participants des autres OpenLabs. Ce sera l'occasion d'échanges et de networking sur les sujets abordés par les thématiques des labs.</p> <p> </p>","event_url":"https://www.meetup.com/GDG-Toulouse/events/63737872/","yes_rsvp_count":43,"announced":true,"name":"Session 1 : Ergonomie native (smartphones et tablettes) et présentation de Unity","id":"63737872","time":"2012-06-02T12:00:00.000Z","updated":1361390564000,"group":{"join_mode":"open","created":1335779291000,"name":"GDG Toulouse","group_lon":1.4500000476837158,"id":3769052,"urlname":"GDG-Toulouse","group_lat":43.619998931884766,"who":"passionnés"},"status":"past"},{"utc_offset":3600000,"venue":{"country":"fr","localized_country_name":"France","city":"Toulouse","address_1":"7 Avenue Parmentier  31200 Toulouse","name":"Ecole d'informatique SupInfo","lon":1.429574,"id":7072632,"lat":43.614071,"repinned":false},"rsvp_limit":60,"headcount":0,"visibility":"public","waitlist_count":0,"created":1358237288000,"rating":{"count":10,"average":4.800000190734863},"maybe_rsvp_count":0,"description":"<p>C'est parti pour la deuxième session du groupe (la première en tant que Android User Group).</p> <p>Pour cette session, nous serons accueillis une nouvelle fois par l'école SupInfo.</p> <p><b>SUPINFO</b> est une école supérieure privée d'informatique fondée en 1965. L'établissement a pour but de former des experts en technologies de l'information et de la communication (TIC). L'école est reconnue par l'État français, elle délivre un titre d’<i>Expert en informatique et systèmes d’information</i> enregistré au Répertoire national des certifications professionnelles au niveau I (bac+5).</p> <p>Le campus de Toulouse, situé au 7 avenue Parmentier (31200 – Métro Canal du Midi), compte aujourd'hui environ 198 étudiants. Fort de son dynamisme, SUPINFO Toulouse crée de nombreux partenariats avec des entreprises (SSII, industries…) et organise des conférences à la pointe de la technologie pour ses étudiants et ses partenaires. Site web : <a href=\"http://www.supinfo.com/toulouse/\"><a href=\"http://www.supinfo.com/toulouse/\" class=\"linkified\">http://www.supinfo.com/toulouse/</a></a></p> <p><a href=\"http://3.bp.blogspot.com/-TCTWtks1Sjk/T85L-pDH_1I/AAAAAAAAESs/R9jw_v7GFsA/s1600/SupInfoLogo.png\"><img src=\"http://3.bp.blogspot.com/-TCTWtks1Sjk/T85L-pDH_1I/AAAAAAAAESs/R9jw_v7GFsA/s200/SupInfoLogo.png\" /></a></p> <p> </p> <p>Pour l'instant, nous n'avons pas de sponsor. Si vous êtes intéressé par un slot de 10 minutes en début de session en échange du financement du pot de fin de conférence, merci de contacter julien.delrio(chez)gmail.com</p> <p> </p> <p>Au programme, deux conférences vous seront proposées :</p> <p><b>Développer son widget pour Android</b> par <a href=\"https://plus.google.com/u/0/112066854034638430359/posts\">Julien Del Rio</a>.<br/>Cette session vous permettra de connaitre les bases des widgets Android, les dernières méthodes ajoutées dans les versions Android et pleins de conseils pour gérer au mieux vos mises à jour et vos RemoteViews. <b>Dernières nouveaautés de JellyBean</b> par Nicolas Pomepuy.<br/>Cette session décrira les dernières nouveautés Android dont les Notifications étendues, les widgets sur le LockScreen ou l'API DayDream.  </p> <p>Ces présentations seront assurées par deux personnes de la société LevelUp Studio.</p> <p><img src=\"http://photos4.meetupstatic.com/photos/event/8/4/1/4/event_117393812.jpeg\" /></p> <p>Basée à Toulouse, en France, LevelUp Studio est une société avec des idées innovantes et une conception amenant ses applications à devenir les plus grands noms du Google Play Store. Notre expérience en tant que développeurs nous permet de parfaitement maitriser les plateformes mobiles, et de nous assurer que nos produits sont les meilleurs dans leur catégorie et répondent aux exigeantes grandissantes des utilisateurs. Applications :</p> <p><a href=\"https://play.google.com/store/apps/details?id=com.levelup.beautifulwidgets\">Beautiful Widgets</a> P<a href=\"https://play.google.com/store/apps/details?id=com.levelup.touiteur\">lume for Twitter</a> Peti <a href=\"https://play.google.com/store/apps/details?id=com.levelup.beautifulwidgets\">&lt;/a&gt; &lt;a href=\"https://play.google.com/store/apps/details?id=com.levelup.touiteur\"&gt;</a> Site web : <a href=\"http://levelupstudio.com/\"><a href=\"http://levelupstudio.com/\" class=\"linkified\">http://levelupstudio.com/</a></a> Comme dit précédemment, nous n'avons pas encore de sponsor. Donc pour le pot informel, nous nous dirigerons vers un bar des alentours.</p>","event_url":"https://www.meetup.com/GDG-Toulouse/events/99682822/","yes_rsvp_count":36,"announced":true,"name":"Session 2 : Créer un widget et les nouveautés de Jelly Bean","id":"99682822","time":"2013-02-20T17:45:00.000Z","updated":1361457792000,"group":{"join_mode":"open","created":1335779291000,"name":"GDG Toulouse","group_lon":1.4500000476837158,"id":3769052,"urlname":"GDG-Toulouse","group_lat":43.619998931884766,"who":"passionnés"},"status":"past"},{"utc_offset":7200000,"venue":{"country":"fr","localized_country_name":"France","city":"Toulouse","phone":" 05 32 10 81 27 ","address_1":"27 Rue d'Aubuisson","name":"La Cantine","lon":1.454036,"id":11215992,"lat":43.602768,"repinned":false},"rsvp_limit":60,"headcount":0,"visibility":"public","waitlist_count":0,"created":1362672178000,"rating":{"count":6,"average":4.829999923706055},"maybe_rsvp_count":0,"description":"<p>Pour ceux qui ne connaissent pas La Cantine, voici un petit rappel sur cet endroit devenu incontournable pour tout professionnel lié de près ou de loin aux TIC :</p> <p>Le concept de Cantine s’est installé dans la Ville Rose début 2011. Un an plus tard, plus de 6 000 visiteurs ont déjà découvert l’espace numérique toulousain. Ce lieu, initié par l’association La Mêlée et que la communauté urbaine Toulouse Métropole a souhaité reprendre, élargir et enrichir, prend place dans le centre ville, au <a href=\"https://plus.google.com/109826206982093616576/about?gl=fr&amp;hl=fr\">27 rue d’Aubuisson</a>. <b>Mais au fait, La Cantine, qu’est ce que c’est ?</b> Agitateur d’idées, La Cantine est avant tout un lieu d’échange, de rencontres et d’expérimentation ouvert à tous les curieux et passionnés du Numérique. La pluralité des profils et parcours des visiteurs fait de La Cantine un espace d’intense brassage. De ceux qui y passent une journée entière à y travailler à ceux qui décident d’y suivre une formation de quelques heures : tous y sont réunis dans un même esprit à la fois sérieux et convivial. Y passer le temps d’un simple café pris sur le pouce, c’est déjà s’offrir une opportunité de côtoyer le quotidien des nouvelles tendances numériques. Pour plus d'informations, <a href=\"http://lacantine-toulouse.org/la-cantine-toulouse\">visitez le site</a>.  </p> <p>SPONSORING</p> <p>Nous remercions le sponsor de cette session : SII Toulouse. Grâce à eux, nous pourrons profiter de pizzas et boissons à la fin de la session.</p> <p><br/>Pour ceux qui ne les connaissent pas, qui sont SII ?</p> <p>Véritable partenaire technologique, SII apporte des solutions à forte valeur ajoutée aux projets informatiques de nombreuses grandes entreprises.<br/><b>Depuis sa création en 1979, la société offre des réponses adaptées aux besoins de ses clients grâce à :<br/></b></p> <p><b>Une expertise 'métiers' et sectorielle reconnue</b> Des solutions 'clés en main' éprouvées Un système qualité efficient Des modes d'intervention modulables et évolutifs <b>Aujourd'hui, avec 46 implantations en France et à l'international</b> etplus de 4500 collaborateurs, le groupe SII a généré sur son dernier exercice un chiffre d'affaires de 259,3 millions d'euros, soit une progression de 16,7 % de son activité.  </p> <p>Retouvez les sur leur site : <a href=\"http://www.groupe-sii.com/fr\"><a href=\"http://www.groupe-sii.com/fr\" class=\"linkified\">http://www.groupe-sii.com/fr</a></a></p> <p>\n\n\n\nCONTENU</p> <p>Maintenant, venons en au contenu de cette session. 2 conférences vous seront proposées pour parfaire vos compétences autour du développement Android.</p> <p><b>Développer avec les droits root</b><br/>Cette conférence vous permettra de connaitre et de comprendre l'utilisation du root (ou super-utilisateur), pourquoi en avoir besoin, et surtout quel sont les risques liés au \"root\" d'un appareil Android.</p> <p>Elle vous sera présenté par <a href=\"http://plus.google.com/111540933261208520135\">Julien REYNAUD</a>.<br/>Julien, 29 ans, est développeur pour SII à Toulouse.<br/>Après des études à l'IMERIR de Perpignan axées sur l'informatique et la robotique, il rejoint SII en 2008.<br/>En tant que fan et early-adopter, il se fait remarquer pour évoluer en tant que développeur Android. Il travaille donc depuis 2010 sur des missions pour Intel (Mobility), notamment sur des applications métier spécifique.<br/>Il développe aussi quelques applications pour lui et fait de la customisation de ROM. Son prochain projet personnel est d'interface un téléphone Android avec une carte Arduino. <b>Développement avec AndroidAnnotations</b><br/><a href=\"http://plus.google.com/105153647746783659669\">Romain Piel</a> présentera la librairie open-source AndroidAnnotations développée par <a href=\"https://twitter.com/piwai\">Pierre-Yves Ricau</a>. Cette librairie vise à simplifier le développement d'applications Android en se basant sur des annotations Java pour générer du code à la compilation du projet.</p> <p>Romain Piel (<a href=\"https://twitter.com/_rpiel\">@_rpiel</a>) est un passionné d'Android depuis plusieurs années. Sa dernière application, <a href=\"https://play.google.com/store/apps/details?id=in.rob.client\">Robin</a> (client pour App.net) connait un grand succès sur le Play Store. Il travaille depuis quelques mois pour la start-up anglaise <a href=\"http://www.mpme.com/\">MPme</a> sur une application de streaming radio intelligent.  </p>","event_url":"https://www.meetup.com/GDG-Toulouse/events/108096052/","yes_rsvp_count":38,"announced":true,"name":"Session 3 : Développer en root et Découvrir la librairie AndroidAnnotations","id":"108096052","time":"2013-04-24T16:30:00.000Z","updated":1368733053000,"group":{"join_mode":"open","created":1335779291000,"name":"GDG Toulouse","group_lon":1.4500000476837158,"id":3769052,"urlname":"GDG-Toulouse","group_lat":43.619998931884766,"who":"passionnés"},"status":"past"},{"utc_offset":7200000,"venue":{"country":"fr","localized_country_name":"France","city":"Toulouse","address_1":"19 Rue de Bayard, 31000 Toulouse","name":"Ecole Epitech","lon":1.448193,"id":13652212,"lat":43.60918,"repinned":false},"rsvp_limit":60,"headcount":0,"visibility":"public","waitlist_count":0,"created":1369646833000,"rating":{"count":13,"average":3.9200000762939453},"maybe_rsvp_count":0,"description":"<p>Nous voilà de retour pour une nouvelle session. Dernière session avant un break pour l'été, où nous n'organiseront que des afterworks pour garder contact. (l'article a été rédige depuis un clavier qwerty, il peut manquer quelques accents...)</p> <p> </p> <p>Sponsor de la session</p> <p><br/>Cette session, nous serons sponsorisés par la société Prometil. Grâce à eux, nous pourrons disposer de boissons et pizzas en fin de session pour rester discuter.</p> <p>Si vous ne les connaissez pas, voici toutes les informations utiles à propos de Prometil.</p> <p>\n\n<a href=\"http://3.bp.blogspot.com/--30fyEZT-YY/UaSvAczKecI/AAAAAAAAIeE/l98ANmUDLp8/s1600/logo+(1).png\"><img src=\"http://3.bp.blogspot.com/--30fyEZT-YY/UaSvAczKecI/AAAAAAAAIeE/l98ANmUDLp8/s1600/logo+(1).png\" /></a>Prometil est une société de services en informatique basée à Toulouse. Après 5 ans d'existence et d'expérience sur le développement NTIC, notamment autour des technologies Java, Prometil a décidé après le développement de plusieurs projets clients autour de la mobilité, de développer une marque dédiée à cette activité.<br/>Prometil développe aujourd'hui OneLight, entité totalement dédiée au développement mobile (Android et Iphone). OneLight évoluera sur le marché B2B, sa vocation étant d'accompagner les entreprises dans leurs stratégies mobile, de travailler en partenariat autour de leurs applications.<br/>Le savoir faire de OneLight s'étend à la géolocalisation, les applications de gestion d'entreprise (Web+Mobile) et aux applications mobiles sur le point de vente.</p> <p>Nous développons également via notre studio, des applications propres à OneLight, celles-ci dédiées au marché B2C. Nous travaillons par exemple actuellement sur le développement de deux applications novatrices autour des données libérées de VéloToulouse et d'une wishlist.<br/>Si vous voulez plus d'informations, pensez à <a href=\"http://www.prometil.com/\">visiter leur site</a>. Lieu de la session et horaires</p> <p>Cette session aura lieu dans l'école d'ingénieur Epitech, que les habitués du <a href=\"http://toulousejug.org/\">Toulouse Java User Group</a> connaissent bien.</p> <p>Si vous vous ne les connaissez pas, lisez les quelques lignes qui vont suivre</p> <p><a href=\"http://4.bp.blogspot.com/-UcLeaYp5mJk/UaUY32nQ9VI/AAAAAAAAIeY/XsNjpZ3sjno/s1600/logo-epitech.jpg\"><img src=\"http://4.bp.blogspot.com/-UcLeaYp5mJk/UaUY32nQ9VI/AAAAAAAAIeY/XsNjpZ3sjno/s1600/logo-epitech.jpg\" /></a>Epitech est aujourd’hui reconnue comme l’une des meilleures écoles d’expertise informatique de haut niveau recherchée par les entreprises. Cette formation repose sur un modèle novateur qui met l’accent sur trois qualités de plus en plus exigées : l’adaptabilité, l’auto-progression, le sens du projet.</p> <p>Le diplôme d’Epitech est homologué par l’Etat au plus haut niveau (Niveau I) et porté au Registre National des Certifications Professionnelles. L’école est présente dans 12 villes de France. Toutes les informations sur l’école et le réseau sur <a href=\"http://www.epitech.eu/\">leur site</a>. Donc retrouvons nous le 19 juin a partir de 18h45 <a href=\"https://maps.google.fr/maps?ie=UTF-8&amp;q=epitech+toulouse&amp;fb=1&amp;gl=fr&amp;hq=epitech&amp;hnear=0x12aebb6fec7552ff:0x406f69c2f411030,Toulouse&amp;cid=0,0,4823795876628661350&amp;ei=ihmlUaH5O6jB7AaFroHwBw&amp;ved=0CLcBEPwSMAM\">19 Rue de Bayard, 31000 Toulouse</a>.</p> <p>\n\nContenu de la session</p> <p>Au programme de cette session, deux conférence vous seront proposées.</p> <p>\n\nPremière partie : Monétisation par la publicité et dernières nouveautés de la solution AdMob par Google</p> <p><a href=\"http://4.bp.blogspot.com/-T-Aux40Qm6Q/UaUfzf8ewXI/AAAAAAAAIeo/pRVjTadNVPs/s1600/logo4w.png\"><img src=\"http://4.bp.blogspot.com/-T-Aux40Qm6Q/UaUfzf8ewXI/AAAAAAAAIeo/pRVjTadNVPs/s200/logo4w.png\" /></a>Anntao Diaz, <a href=\"http://www.linkedin.com/pub/anntao-diaz/24/898/97b\">Publishers Strategic Partnerships Development - France, UK &amp; Spain</a> chez Google, vous proposera une conférence en deux parties. Dans la première  il vous prodiguera les meilleurs conseils pour ajouter de la publicité dans votre application et la rendre la plus efficace possible. Dans la seconde, il vous présentera les dernières nouveautés de la solution AdMob, annoncées lors du dernier Google IO.</p> <p>\n\nDeuxieme partie : Developpement 3D avec jMonkeyEngine</p> <p>Cette conférence vous sera proposée par <a href=\"https://plus.google.com/104291710175054233916/posts\">Rémy Bouquet</a>. Rémy est développeur Java, JEE depuis l'an 2000, dans une compagnie aérienne française. Sur son temps libre, il est un membre de l'équipe de développement de jMonkeyEngine, un moteur 3D basé sur OpenGL entièrement écrit en Java. Les jeux faits avec JME peuvent être déployés sur diverses plateformes et notamment Android. Il vous parlera rapidement des grands principes du développement graphique 3D, puis de mettra l'accent sur le développement de jeux sur Android avec le moteur.</p>","event_url":"https://www.meetup.com/GDG-Toulouse/events/121412292/","yes_rsvp_count":33,"duration":13500000,"announced":true,"name":"Session 4 : Monétisation par la pub, et 3D avec jMonkeyEngine","id":"121412292","time":"2013-06-19T16:45:00.000Z","updated":1371799058000,"group":{"join_mode":"open","created":1335779291000,"name":"GDG Toulouse","group_lon":1.4500000476837158,"id":3769052,"urlname":"GDG-Toulouse","group_lat":43.619998931884766,"who":"passionnés"},"status":"past"},{"utc_offset":7200000,"venue":{"country":"fr","localized_country_name":"France","city":"Toulouse","address_1":"35 Grande Rue Saint Michel","name":"Ô Comptoir","lon":1.44661,"id":14342342,"lat":43.587257,"repinned":false},"headcount":13,"visibility":"public","waitlist_count":0,"created":1372801684000,"rating":{"count":1,"average":5},"maybe_rsvp_count":0,"description":"<p>Alors <a href=\"http://1.bp.blogspot.com/-z747sMbPntY/TfiaoVr8qTI/AAAAAAAAAaY/L9x2KUtbBA8/s200/aperoandroid_nico_small.pngque\" class=\"linkified\">http://1.bp.blogspot.com/-z747sMbPntY/TfiaoVr8qTI/AAAAAAAAAaY/L9x2KUtbBA8/s200/aperoandroid_nico_small.pngque</a> l'été pointe à peine le bout de son nez, nous vous proposons un apéro en centre-ville afin de patienter jusqu’à la prochaine session de septembre.</p> <p><br/>Ce sera l'occasion pour chacun de passer un moment convivial autour d'un verre et d'en connaître un peu plus sur la communauté Android de Toulouse.</p> <p>Que vous soyez développeurs confirmés ou débutants, professionnels, hackers ou tout simplement curieux d'Android, vous êtes tous les bienvenus ! Ce petit moment nous permettra de parler des évènements passés et à venir mais également de partager nos expériences, astuces et connaissances sur Android.</p> <p>Le rendez-vous est fixé au Mercredi 10 Juillet 2013 à 18h au bar Ô'Comptoir situé devant la sortie \"Saint-Michel Marcel Langer\" de la ligne B.</p> <p><br/>On espère vous voir nombreux.</p>","event_url":"https://www.meetup.com/GDG-Toulouse/events/127644782/","yes_rsvp_count":13,"announced":true,"name":"Apéro Android","id":"127644782","time":"2013-07-10T16:00:00.000Z","updated":1373547032000,"group":{"join_mode":"open","created":1335779291000,"name":"GDG Toulouse","group_lon":1.4500000476837158,"id":3769052,"urlname":"GDG-Toulouse","group_lat":43.619998931884766,"who":"passionnés"},"status":"past"},{"utc_offset":7200000,"venue":{"country":"fr","localized_country_name":"France","city":"Toulouse","address_1":"35 Grande Rue Saint Michel","name":"Ô Comptoir","lon":1.44661,"id":14342342,"lat":43.587257,"repinned":false},"headcount":0,"visibility":"public","waitlist_count":0,"created":1374440656000,"rating":{"count":5,"average":4},"maybe_rsvp_count":0,"description":"<p><a href=\"http://1.bp.blogspot.com/-z747sMbPntY/TfiaoVr8qTI/AAAAAAAAAaY/L9x2KUtbBA8/s200/aperoandroid_nico_small.pngLe\" class=\"linkified\">http://1.bp.blogspot.com/-z747sMbPntY/TfiaoVr8qTI/AAAAAAAAAaY/L9x2KUtbBA8/s200/aperoandroid_nico_small.pngLe</a> premier apéro Android ayant été un succès, nous ré-organisons un second apéro le Mercredi 28 Août au bar Ô'Comptoir, situé devant la sortie \"Saint-Michel Marcel Langer\" de la ligne B.</p> <p>Ce sera l'occasion pour chacun de passer un moment convivial autour d'un verre et d'en connaître un peu plus sur la communauté Android de Toulouse.</p> <p>Que vous soyez développeurs confirmés ou débutants, professionnels, hackers ou tout simplement curieux d'Android, vous êtes tous les bienvenus ! Ce petit moment nous permettra de parler des évènements passés et à venir mais également de partager nos expériences, astuces et connaissances sur Android.</p> <p>On espère vous voir nombreux.</p> <p> </p>","event_url":"https://www.meetup.com/GDG-Toulouse/events/130686532/","yes_rsvp_count":14,"announced":true,"name":"Nouvel Apéro Android","id":"130686532","time":"2013-08-28T16:30:00.000Z","updated":1377765659000,"group":{"join_mode":"open","created":1335779291000,"name":"GDG Toulouse","group_lon":1.4500000476837158,"id":3769052,"urlname":"GDG-Toulouse","group_lat":43.619998931884766,"who":"passionnés"},"status":"past"},{"utc_offset":7200000,"venue":{"country":"fr","localized_country_name":"France","city":"Toulouse","address_1":"19 Rue de Bayard, 31000 Toulouse","name":"Ecole Epitech","lon":1.448193,"id":13652212,"lat":43.60918,"repinned":false},"headcount":0,"visibility":"public","waitlist_count":0,"created":1378671533000,"rating":{"count":5,"average":4.199999809265137},"maybe_rsvp_count":0,"description":"<p>Grand événement, malgré un retard d'annonce dû aux vacances, le Toulouse Android User Group et le Toulouse Java User Group s'associent pour une conférence commune.</p> <p>Pour cette session, nous vous attendrons le jeudi 19 septembre dès 18h45 pour un début des hostilités à 19h00 tapantes.</p> <p><b>Sponsor</b></p> <p>Faute de temps et avec les vacances qui sont passées par là, nous n'avons pour l'instant, pas de sponsor pour cette session. N'hésitez pas à nous contactez si vous connaissez une entreprise intéressée par le sponsoring de cette session, de notre côté on continue les recherches :)</p> <p><b>Lieu</b></p> <p>Nous vous entendrons une nouvelle fois à Epitech, rue de Bayard. Vous les connaissez surement, mais au cas où :</p> <p><img src=\"http://photos4.meetupstatic.com/photos/event/8/0/6/8/600_280832872.jpeg\" /> <i>Epitech est aujourd’hui reconnue comme l’une des meilleures écoles d’expertise informatique de haut niveau recherchée par les entreprises. Cette formation repose sur un modèle novateur qui met l’accent sur trois qualités de plus en plus exigées : l’adaptabilité, l’auto-progression, le sens du projet. </i></p> <p><i>Le diplôme d’Epitech est homologué par l’Etat au plus haut niveau (Niveau I) et porté au Registre National des Certifications Professionnelles. L’école est présente dans 12 villes de France.Toutes les informations sur l’école et le réseau sur <a href=\"http://www.epitech.eu/\">leur site</a>.</i></p> <p><b>Contenu des conférences</b></p> <p>Maintenant, on sait quand, on sait où ! Vous vous dites pourquoi vais-je devoir venir ? Pour cette fois-ci, 3 conférences vous serons proposées :</p> <p>• <a href=\"http://www.android2ee.com/\">Mathias Seguy, formateur Android</a>, vous proposera 45 minutes sur l'utilisation de Google Sign-In sur Android. On verra pas mal de code pour que vous sachiez concrètement comment l'implémenter dans vos applications.</p> <p><br/>• <a href=\"http://www.robusta.io\">Nicolas Zozol</a>, vous proposera pendant 30 minutes de revenir à vos fondamentaux; parce que parfois il le faut ! Back to Basics Partie 1 : Les Threads. \"<i>De notify à fork/join, je montrerai la variété des solutions apportées par le JDK pour résoudre les problèmes de concurrences.</i>\"</p> <p>• Enfin, <a href=\"http://www.twitter.com/bmathus\">Baptiste Mathus</a> et <a href=\"http://www.twitter.com/bluxte\">Sylvain Wallez</a>, animeront \"Pull-request GitHub, ou pourquoi c'est devenu très facile de contribuer à l'opensource\". Ils vous expliqueront le principe d'une pull-request et ils vous montreront comment en \"envoyer\" une.</p> <p><br/>Nous vous attendrons donc toujours avec la même motivation et la même bonne humeur ! Et rassurez vous, les pizzas sont bien prévues avec ou sans sponsor.</p>","how_to_find_us":"En rentrant, c'est à 10 mètres et à droite !","event_url":"https://www.meetup.com/GDG-Toulouse/events/139107412/","yes_rsvp_count":44,"duration":11700000,"announced":true,"name":"Session TAUG - JUG : \"Google Sign-In sur Android\" \"Back to Basics : Les Threads\"","id":"139107412","time":"2013-09-19T16:45:00.000Z","updated":1379706013000,"group":{"join_mode":"open","created":1335779291000,"name":"GDG Toulouse","group_lon":1.4500000476837158,"id":3769052,"urlname":"GDG-Toulouse","group_lat":43.619998931884766,"who":"passionnés"},"status":"past"},{"utc_offset":3600000,"venue":{"country":"fr","localized_country_name":"France","city":"Toulouse","address_1":"7 Avenue Parmentier  31200 Toulouse","name":"Ecole d'informatique SupInfo","lon":1.429574,"id":7072632,"lat":43.614071,"repinned":false},"headcount":45,"visibility":"public","waitlist_count":0,"created":1384285577000,"rating":{"count":7,"average":4.710000038146973},"maybe_rsvp_count":0,"description":"<p>Nous voici de retour !</p> <p>Après <a href=\"http://toulouseaug.blogspot.fr/2013/10/compte-rendu-de-la-session-de-septembre.html\">une précédente session</a> en compagnie du Java User Group de Toulouse qui s'est avérée être une réussite, nous reprenons nos sessions autonomes.</p> <p><br/>Pour cette session, au départ était prévu une conférence sur les outils pour optimiser les performances de vos applications, mais avec la sortie de Android 4.4, aka KitKat, il a fallut s'adapter. C'est pas plus mal, l'autre présentation était pas complètement prête ;). Et à cette conférence, nous ajouterons l'intervention de Intel, sponsor de la soirée, pour vous présenter les outils pour optimiser vos apps pour leur architecture.</p> <p><br/>Comme d'habitude, en fin de session un petit apéro et quelques pizzas seront servis afin de finir la conférence dans la bonne humeur.</p> <p><br/><a href=\"http://4.bp.blogspot.com/-KbNTtOC18ro/Unz_WFVOidI/AAAAAAAAKYY/JSpn3ySRe9A/s1600/android-4.4-kitkat-ameliorations-smart-tv.jpg\">&lt;/a&gt;</p> <p>&lt;a href=\"http://4.bp.blogspot.com/-KbNTtOC18ro/Unz_WFVOidI/AAAAAAAAKYY/JSpn3ySRe9A/s1600/android-4.4-kitkat-ameliorations-smart-tv.jpg\"&gt;</a></p> <p><a href=\"http://4.bp.blogspot.com/-KbNTtOC18ro/Unz_WFVOidI/AAAAAAAAKYY/JSpn3ySRe9A/s1600/android-4.4-kitkat-ameliorations-smart-tv.jpg\"><img src=\"http://4.bp.blogspot.com/-KbNTtOC18ro/Unz_WFVOidI/AAAAAAAAKYY/JSpn3ySRe9A/s400/android-4.4-kitkat-ameliorations-smart-tv.jpg\" /></a></p> <p><b>C'est pour quand ?</b></p> <p>Donc, pour cette session, nous vous donnons rendez vous le lundi 25 novembre à partir de 18h45 et pour un départ des présentations dès 19h.</p> <p><b>Et c'est où ?</b></p> <p>Nous seront accueillis cette fois chez SupInfo Toulouse. Leur école se situe <a href=\"http://goo.gl/maps/Oorsq\">7 Avenue Parmentier, 31200 Toulouse</a>. Si vous ne les connaissez pas, un petit rappel s'impose.</p> <p><a href=\"http://www.supinfo.com/images/fr/SupInfoLogo.png\">&lt;/a&gt;<b>SUPINFO </b>est une école supérieure privée d'informatique fondée en 1965. L'établissement a pour but de former des experts en technologies de l'information et de la communication (TIC). L'école est reconnue par l'État français, elle délivre un titre d’<i>Expert en informatique et systèmes d’information</i> enregistré au Répertoire national des certifications professionnelles au niveau I (bac+5).</p> <p><img src=\"http://www.supinfo.com/images/fr/SupInfoLogo.png\" /></p> <p>Site web : &lt;a href=\"http://www.supinfo.com/toulouse/\"&gt;<a href=\"http://www.supinfo.com/toulouse/\" class=\"linkified\">http://www.supinfo.com/toulouse/</a></a></p> <p><b>C'est qui le sponsor ?</b></p> <p>&lt;a href=\"http://4.bp.blogspot.com/-UInVem1FK8E/UoKEPcbhcKI/AAAAAAAAKgo/4VVitaZi19E/s1600/intel_software_partner.png\"&gt;&lt;/a&gt;</p> <p>\n\n\n<img src=\"http://photos1.meetupstatic.com/photos/event/d/a/e/0/600_306836032.jpeg\" /></p> <p>Nous seront sponsorisé pour cette session par Intel Corporation. </p> <p>Intel Corporation est le plus important fabricant de microprocesseurs au monde en terme de revenu. C’est le créateur d’u premier microprocesseur et il continue a être leader au niveau du processus de fabrication. Depuis juin 2012, les SOCs Intel équipent aussi certain smartphones et tablettes disponibles dans le commerce, avec la perspective d’évoluer rapidement sur ce marché.</p> <p>Visitez le site dédié à Android : <a href=\"http://software.intel.com/fr-fr/android/\"><a href=\"http://software.intel.com/fr-fr/android/\" class=\"linkified\">http://software.intel.com/fr-fr/android/</a></a></p> <p><b>De quoi va-t-on parler ?</b></p> <p>J'ai commencé à vous mettre un peu l'eau à la bouche. Vous voulez maintenant un peu plus de détails. Demandez le programme.</p> <p><i>Présentation 1 :</i></p> <p>La première partie aura pour titre : Android sur les plateformes Intel et développement d’applications double-écran sur Android.</p> <p>L’existence de terminaux Android à architecture x86 est maintenant une réalité. Venez découvrir ce que fait Intel dans ce secteur et ce que cela implique (ou non!) pour vos applications.</p> <p>Dans une seconde partie, nous aborderons les technologies d’affichage sans-fil présentes sur de plus en plus de périphériques Android (pas seulement x86) et comment développer une application qui en tire partie, au travers de l’API Presentation.</p> <p><a href=\"http://plus.google.com/106834066322753191683\">Xavier Hallade</a> est ingénieur logiciel chez Intel France, sa mission principale est d’aider les développeurs Android à mieux utiliser les capacités des smartphones et tablettes Android à architecture x86.</p> <p><br/><i>Présentation 2 : Les nouveautés de Android 4.4 aka KitKat</i></p> <p>Vous n'avez pas pu passer à côté, 31 octobre 2013, pour détendre l'ambiance effrayante d'Halloween, Google a annoncé sa nouvelle version. <a href=\"http://plus.google.com/112066854034638430359\">+Julien Del Rio</a>, CTO chez LevelUp Studio et président du TAUG, vous présentera cette nouvelle version. Vous y verrez :</p> <p>• Les nouveautés pour les utilisateurs</p> <p>• Les nouvelles APIs</p> <p>• Les anciennes APIs qui ont pu évoluer</p> <p>Soyez prêt à passer toutes vos applications en target 19 dès la fin de la conférence.</p>","event_url":"https://www.meetup.com/GDG-Toulouse/events/150547182/","yes_rsvp_count":42,"announced":true,"name":"Session novembre 2013 : \"Nouveautés de Android 4.4\" et \"Optimisations­ Intel\"","id":"150547182","time":"2013-11-25T18:00:00.000Z","updated":1385488340000,"group":{"join_mode":"open","created":1335779291000,"name":"GDG Toulouse","group_lon":1.4500000476837158,"id":3769052,"urlname":"GDG-Toulouse","group_lat":43.619998931884766,"who":"passionnés"},"status":"past"},{"utc_offset":3600000,"venue":{"country":"fr","localized_country_name":"France","city":"Toulouse","phone":" 05 32 10 81 27 ","address_1":"27 Rue d'Aubuisson","name":"La Cantine","lon":1.454036,"id":11215992,"lat":43.602768,"repinned":false},"rsvp_limit":60,"headcount":0,"visibility":"public","waitlist_count":2,"created":1388143299000,"rating":{"count":11,"average":4.730000019073486},"maybe_rsvp_count":0,"description":"<p>Pour démarrer cette nouvelle saison, nous vous avons préparé un très sympathique programme. Nous parlerons a la fois Cloud et optimisations pour qu'il y en ai pour tous les goûts. Et nous serons dans un des lieux centraux de Toulouse pour le partage de connaissance IT.</p> <p><b>Date et heure</b></p> <p>Pour le premier rendez-vous de 2014, nous vous attendrons le mercredi 29 janvier à partir de 18h45 pour un début des hostilités à 19h. Nous serons à La Cantine de Toulouse, dans le centre ville, au <a href=\"https://plus.google.com/109826206982093616576/about?gl=fr&amp;hl=fr\">27 rue d’Aubuisson</a>.</p> <p><b>Contenu</b></p> <p>Maintenant, venons en au contenu de cette session. 2 conférences vous seront proposées pour parfaire vos compétences autour du développement Android.</p> <p><br/><a href=\"http://4.bp.blogspot.com/-oNBgAT4TNN0/Usqia797QkI/AAAAAAAALnU/MXkK4iK3wVw/s1600/title.png\">&lt;/a&gt;<br/>Pour début, &lt;a href=\"https://plus.google.com/101932012361889521527\"&gt;Alexis Moussine-Pouchkine</a> viendra de Google Paris vous présenter \"Mobile Banckend Starter\". On le remercie ainsi que Google pour l'aide à la prise en charge des pizzas.</p> <p><br/><i>Une application mobile sans backend digne de ce nom c’est un peu comme un Ferrari avec un moteur de Trabant. Et si vous pouviez, à moindre coût, mettre un turbo sur votre appli Android ? Le ”Mobile Backend Starter” permet de stocker des données utilisateurs d’applications mobiles (configurations, données, état partagé entre utilisateurs, …). </i></p> <p><i>Cette solution élimine le besoin de coder coté serveur et de gérer des serveurs, il intègre Google Cloud Messaging et évite toute saisie de mot de passe à l’utilisateur. Cette session détaillera la solution technique et les technologies sous-jacentes comme Google AppEngine, Cloud Endpoints, Cloud Messaging coté serveur et le travail nécessaire coté client Android pour bénéficier de ces fonctionnalités.</i></p> <p>\n\nDans un second temps, <a href=\"https://plus.google.com/100639673210990547429\">+Romain Mouton</a> de la société <a href=\"http://www.levelupstudio.com/\">LevelUp Studio</a> viendra vous présenter quelques outils pour l'optimisation de vos apps avec une présentation titrée \"Boite à outil du bon développeur Android\". Parce que des belles features c'est bien, mais des features sans lag, c'est mieux ;)</p> <p><i>Une introduction technique aux différents outils à connaitre pour maîtriser au mieux la plateforme Android et devenir un développeur d'application performante. On parlera surement de CPU de GPU d'ANR de freeze de thread de deadlock et bien d'autres mot anglais qu'il ne faut surtout pas essayer de traduire !</i></p> <p><b>Et quelques rappels</b></p> <p>Rappelez vous que nous proposons à toute entreprise de sponsoriser une session pour profiter de la communication de l'événement et de 10 minutes de discours libre en début de session.</p> <p>Et si vous êtes à la recherche d'un emploi dans le mobile à Toulouse ou possédez une offre, ça se passe sur notre <a href=\"https://groups.google.com/forum/#!forum/taug-emploi\">jobs board</a>.</p>","event_url":"https://www.meetup.com/GDG-Toulouse/events/157248662/","yes_rsvp_count":60,"duration":11700000,"announced":true,"name":"Google Mobile Backend Starter et outils d'optimisation","id":"157248662","time":"2014-01-29T18:15:00.000Z","updated":1391095325000,"group":{"join_mode":"open","created":1335779291000,"name":"GDG Toulouse","group_lon":1.4500000476837158,"id":3769052,"urlname":"GDG-Toulouse","group_lat":43.619998931884766,"who":"passionnés"},"status":"past"},{"utc_offset":3600000,"venue":{"country":"fr","localized_country_name":"France","city":"Toulouse","address_1":"19 Rue de Bayard, 31000 Toulouse","name":"Ecole Epitech","lon":1.448193,"id":13652212,"lat":43.60918,"repinned":false},"rsvp_limit":60,"headcount":0,"visibility":"public","waitlist_count":0,"created":1394642283000,"rating":{"count":1,"average":4},"maybe_rsvp_count":0,"description":"<p>Voici un événement au sujet un peu annexe de ce que le Toulouse Android User Group fait habituellement. Mais la qualité reste !</p> <p><b>Organisation conjointe avec Epitech Toulouse</b></p> <p><br/><img src=\"http://photos4.meetupstatic.com/photos/event/4/e/1/8/600_341299992.jpeg\" /></p> <p>Tout d'abord, il est important de noter que cet événement sera co-organisé avec l'école d'Epitech Toulouse. Alors que d'habitude il ne font que nous ouvrir bien gentiment leurs locaux, pour cet événement nous travaillerons ensemble.</p> <p><br/><b>Qu'est ce que le Google Cloud Platform Live ?</b></p> <p><br/>Notre soirée a pour objectif de retransmettre une partie du Google Cloud Platform Live, mais qu'est ce donc ?</p> <p><br/><img src=\"http://photos1.meetupstatic.com/photos/event/3/8/9/2/600_341294482.jpeg\" /></p> <p>Un peu sur le modèle de Google IO, le géant de Mountain View nous propose une journée dédiée aux développeurs avec Keynote sur les nouveaux produits et conférences techniques. La particularité, c'est que c'est centré sur les produits cloud.</p> <p><b>Demandez le programme !</b></p> <p>Pour cette soirée, le programme est simple, nous allons retransmettre en live les événements grâce à Youtube.</p> <p>• 17h30 (9h30 à SF) : Keynote<br/><a href=\"http://research.google.com/pubs/author79.html\">Urs Hölzle</a>, vice-président de l'infrastructure technique, va partager la vision de Google pour le cloud computing et annoncera un certain nombre de nouveaux produits et services.<br/>Bobby Murphy, CTO et co-fondateur de Snapchat, fera une apparition pour parler de la construction l'une des applications les plus populaires de la planète sur la plate-forme Cloud.</p> <p><br/>• 19h (11h00 à SF), conférence au choix :<br/>Tour complet des services cloud, construire une application fonctionnant sur la plate-forme Cloud - de la construction, l'essai, le déploiement, la montée en charge jusqu'à créer des milliers de requêtes par seconde.<br/>ou<br/>La puissance du Big Data sur Google Cloud Platform. Comment attaquer de gros volume de données avec les services de Google.</p> <p><br/>Si vous êtes assez nombreux, nous pourrons continuer de diffuser les conférences suivantes à partir de 21h. Nous essaierons de proposer un moyen de manger sur place pour vous inciter à rester ;)</p> <p>Si vous voulez connaitre le programme de toutes les conférences : <a href=\"https://cloud.google.com/events/google-cloud-platform-live/\"><a href=\"https://cloud.google.com/events/google-cloud-platform-live/\" class=\"linkified\">https://cloud.google.com/events/google-cloud-platform-live/</a></a></p> <p><b>Venez nombreux</b></p> <p>Vous l'avez compris, c'est l'occasion pour nous tous de se retrouver entre passionnés pour discuter des technologies cloud, pas que de Google d'ailleurs.</p> <p>Nous vous attendons nombreux.</p>","event_url":"https://www.meetup.com/GDG-Toulouse/events/170885732/","yes_rsvp_count":14,"duration":21600000,"announced":true,"name":"Retransmission Google Cloud Platform Live (avec Epitech Toulouse)","id":"170885732","time":"2014-03-25T16:00:00.000Z","updated":1395821975000,"group":{"join_mode":"open","created":1335779291000,"name":"GDG Toulouse","group_lon":1.4500000476837158,"id":3769052,"urlname":"GDG-Toulouse","group_lat":43.619998931884766,"who":"passionnés"},"status":"past"},{"utc_offset":7200000,"venue":{"country":"fr","localized_country_name":"France","city":"Labège","address_1":"Rue Jean Rostand","name":"TIC Valley","lon":1.511514,"id":18854202,"lat":43.543957,"repinned":false},"rsvp_limit":60,"headcount":0,"visibility":"public","waitlist_count":0,"created":1394399260000,"rating":{"count":5,"average":4.199999809265137},"maybe_rsvp_count":0,"description":"<p>C'est parti pour la deuxième session de cette année 2014 qui avait commencé sur les chapeaux de roue avec la conférence \"<a href=\"http://toulouseaug.blogspot.fr/2014/03/compte-rendu-de-la-session-de-janvier.html\">Google Mobile Backend et les outils d'optimisations</a>\". Cette fois-ci nous serons accueillis par l'un des lieux phares en matière d'Innovation sur Toulouse : la TIC Valley.</p> <p><a href=\"http://3.bp.blogspot.com/-72WSnYCKs48/Ux12KimQ5EI/AAAAAAAAMVQ/0SUOHjAoK-U/s1600/IMG_20140129_211009.jpg\"><a href=\"https://images-blogger-opensocial.googleusercontent.com/gadgets/proxy?url=http%3A%2F%2F3.bp.blogspot.com%2F-72WSnYCKs48%2FUx12KimQ5EI%2FAAAAAAAAMVQ%2F0SUOHjAoK-U%2Fs1600%2FIMG_20140129_211009.jpg&amp;container=blogger&amp;gadget=a&amp;rewriteMime=image%2F\" class=\"linkified\">https://images-blogger-opensocial.googleusercontent.com/gadgets/proxy?url=http%3A%2F%2F3.bp.blogspot.com%2F-72WSnYCKs48%2FUx12KimQ5EI%2FAAAAAAAAMVQ%2F0SUOHjAoK-U%2Fs1600%2FIMG_20140129_211009.jpg&amp;container=blogger&amp;gadget=a&amp;rewriteMime=image%2F</a>*</a></p> <p><b>LIEU</b></p> <p>Crée en 2009 par un groupe d'entrepreneurs, la TIC Valley est une association au sein de laquelle se concentre un ensemble de startups et PME innovantes dans les domaines des Technologies de l'Information et de la Communication. Basée à Labège, la TIC Valley c'est aussi un accélérateur de startups grâce au Camping Toulouse, qui par un programme intensif de 6 mois, permet l'accompagnement de jeunes entreprises du secteur des TIC dans leur création et leur développement.</p> <p>Vous trouverez plus d'infos sur leur site : <a href=\"http://www.tic-valley.fr/\"><a href=\"http://www.tic-valley.fr/\" class=\"linkified\">http://www.tic-valley.fr/</a></a></p> <p><a href=\"http://4.bp.blogspot.com/-OY6j7gpHp44/UxzZykugI3I/AAAAAAAAAtg/Km-_7k9lEsM/s1600/logo-ticvalley-mini.png\"><a href=\"https://images-blogger-opensocial.googleusercontent.com/gadgets/proxy?url=http%3A%2F%2F4.bp.blogspot.com%2F-OY6j7gpHp44%2FUxzZykugI3I%2FAAAAAAAAAtg%2FKm-_7k9lEsM%2Fs1600%2Flogo-ticvalley-mini.png&amp;container=blogger&amp;gadget=a&amp;rewriteMime=image%2F\" class=\"linkified\">https://images-blogger-opensocial.googleusercontent.com/gadgets/proxy?url=http%3A%2F%2F4.bp.blogspot.com%2F-OY6j7gpHp44%2FUxzZykugI3I%2FAAAAAAAAAtg%2FKm-_7k9lEsM%2Fs1600%2Flogo-ticvalley-mini.png&amp;container=blogger&amp;gadget=a&amp;rewriteMime=image%2F</a>*</a></p> <p><b>SPONSORING</b></p> <p>Pour l'instant, nous n'avons pas de sponsor pour cette session. Si vous êtes intéressés par un discours de 10 minutes en début de session ainsi que de profiter de la communication de l'évènement, n'hésitez pas à nous contacter (julien.delrio(at)gmail.com).</p> <p><b>CONTENU</b></p> <p>Maintenant, venons en au contenu de cette session. 2 conférences vous seront proposées pour parfaire vos compétences autour du développement Android.</p> <p>Tout d'abord, Vincent De Chefdebien de Intel viendra vous parler de la \"Création de ROM Android Custom\". Il vous expliquera comment réaliser une ROM Nexus (compilation du code source, modifications des applications, flash...) ainsi que la modification d'une ROM constructeur grâce à Android Kitchen.</p> <p>Pour la deuxième conférence, ce sera Julien Del Rio (<a href=\"https://www.blogger.com/null\">+JulienDelRio</a>) qui se fera un plaisir de vous montrer pourquoi un programme de Beta est indispensable lors du déploiement de votre application. Pour cela il vous présentera les divers outils à utiliser pour suivre et déployer votre application et vous donnera quelques petites astuces de community management.</p> <p><b>INFO PRATIQUES</b></p> <p>Lieu : TIC Valley, Rue Jean Rostand, Labège</p> <p>Horaire : accueil à partir de 18h45 le jeudi 3 avril 2014.</p> <p><b>INSCRIPTIONS</b></p> <p>Ne perdez pas de temps, inscrivez vous !</p> <p><b>RAPPELS</b></p> <p>Rappelez vous que nous proposons à toute entreprise de sponsoriser une session pour profiter de la communication de l'événement et de 10 minutes de discours libre en début de session. <br/>Et si vous êtes à la recherche d'un emploi dans le mobile à Toulouse ou possédez une offre, ça se passe sur notre <a href=\"https://groups.google.com/forum/#!forum/taug-emploi\">jobs board</a>.</p>","how_to_find_us":"ROOF, 4ème étage","event_url":"https://www.meetup.com/GDG-Toulouse/events/170346752/","yes_rsvp_count":54,"duration":11700000,"announced":true,"name":"Création de ROM Custom et Programme de Beta utile sur Android","id":"170346752","time":"2014-04-03T16:45:00.000Z","updated":1396875963000,"group":{"join_mode":"open","created":1335779291000,"name":"GDG Toulouse","group_lon":1.4500000476837158,"id":3769052,"urlname":"GDG-Toulouse","group_lat":43.619998931884766,"who":"passionnés"},"status":"past"},{"utc_offset":7200000,"venue":{"country":"fr","localized_country_name":"France","city":"Toulouse","address_1":"19 Rue de Bayard, 31000 Toulouse","name":"Ecole Epitech","lon":1.448193,"id":13652212,"lat":43.60918,"repinned":false},"rsvp_limit":60,"headcount":0,"visibility":"public","waitlist_count":0,"created":1397294458000,"rating":{"count":5,"average":4.199999809265137},"maybe_rsvp_count":0,"description":"<p>Dernière session régulière avant Google IO Extended et l'été, c'est l'occasion de se revoir, de parler tech et de fêter l'été qui va arriver. La dernière fois nous avons visité les startupeurs de TicValley. Nous revenons cette fois dans un lieu connu.</p> <p><b>C'est pour quand ?</b></p> <p>Donc, pour cette session, nous vous donnons rendez vous le jeudi 5 juin à partir de 18h45 et pour un départ des présentations dès 19h.</p> <p><b>Et c'est où ?</b></p> <p>Nous vous attendrons une nouvelle fois à Epitech, rue Bayard. Vous les connaissez surement, mais au cas où :</p> <p><img src=\"http://photos4.meetupstatic.com/photos/event/8/0/6/8/600_280832872.jpeg\" /></p> <p><i><a href=\"http://www.epitech.eu/toulouse/ecole-informatique-toulouse.aspx\">Epitech</a> est aujourd’hui reconnue comme l’une des meilleures écoles d’expertise informatique de haut niveau recherchée par les entreprises. Cette formation repose sur un modèle novateur qui met l’accent sur trois qualités de plus en plus exigées : l’adaptabilité, l’auto-progression, le sens du projet. </i></p> <p><i>Le diplôme d’Epitech est homologué par l’Etat au plus haut niveau (Niveau I) et porté au Registre National des Certifications Professionnelles. L’école est présente dans 12 villes de France.Toutes les informations sur l’école et le réseau sur <a href=\"http://www.epitech.eu/\">leur site</a>.</i></p> <p><b>C'est qui le sponsor ?</b></p> <p>Pour cette session les pizzas sont de retour. Il faudra bien remercier le sponsor. Commençons par vous le présenter.</p> <p><img src=\"http://photos3.meetupstatic.com/photos/event/9/1/a/2/600_364177282.jpeg\" /><br/><i>PAYMILL : la solution innovante pour accepter le plus facilement les paiements par carte bancaire en ligne et sur mobile. Il n’y a pas de redirection pour votre client final. L’entreprise est la première à avoir apporté la simplicité et l’intuitivité de cette solution en Europe et offre déjà ses services dans 39 pays. </p> <p>Testez maintenant notre API REST securisée : <a href=\"https://paymill.com/fr-fr/\"><a href=\"https://paymill.com/fr-fr/\" class=\"linkified\">https://paymill.com/fr-fr/</a></a></i></p> <p><b>De quoi qu'on parlera ?</b></p> <p>Pour cette session bande de petits veinards ce n'est pas 2 mais 3 conférences qui vous attendent.</p> <p>• <a href=\"https://twitter.com/JuSchz\">Julien Sanchez</a> : Libraries NDK &amp; PDF (45 minutes)<br/>Le SDK Android ne possède pas d'api permettant le rendu de PDF. Julien vous montrera comment traiter cette problématique, via l'utilisation du Native Developement Kit (NDK), la compilation et l'intégration de bibliothèques natives, puis comment protéger ses fichiers et éviter que ceux-ci ne soient accessibles trop facilement. </p> <p><br/>• <a href=\"https://plus.google.com/u/0/+Bishiboosh\">Valentin Rocher</a> :  Robospice (20/25 minutes)<br/>Les appels de webservices sont souvent au centre de la plupart des applications Android. Nous verrons comment Robospice peut aider à les intégrer facilement, et les différentes façons possibles de customiser son utilisation.</p> <p><br/>• <a href=\"http://www.android2ee.com/\">Mathias Seguy - Android2EE</a> : ActionBarCompat<br/>Mathias vous présentera en live coding et sans filet la mise en place de l'ActionBarCompat, en 20 minutes. L'ActionBar mise en place sera compatible de la version 8 (Ginger) à la 19 (KitKat) pour le plus grand plaisir de vos utilisateurs. Vous verrez l'installation, l'ajout d'ItemMenu et, si on a le temps, l'ActionView avec la mise en place de la zone de recherche dans l'ActionBar. Mais si on aura le temps, 20 minutes c'est large pour tout ça :)</p> <p><br/>Quel programme ! me direz vous.</p> <p>Le tout se finira comme annoncé par quelques pizzas.</p> <p><b>Qu'est ce qu'il me reste à faire ?</b></p> <p>Inscris toi vingt dieux ! Et on se voit début juin !</p>","event_url":"https://www.meetup.com/GDG-Toulouse/events/176739222/","yes_rsvp_count":39,"duration":14400000,"announced":true,"name":"Lire un PDF via NDK, Robospice et ActionBarCompat","id":"176739222","time":"2014-06-05T17:00:00.000Z","updated":1402047978000,"group":{"join_mode":"open","created":1335779291000,"name":"GDG Toulouse","group_lon":1.4500000476837158,"id":3769052,"urlname":"GDG-Toulouse","group_lat":43.619998931884766,"who":"passionnés"},"status":"past"},{"utc_offset":7200000,"venue":{"country":"fr","localized_country_name":"France","city":"Toulouse","address_1":"19 Rue de Bayard, 31000 Toulouse","name":"Ecole Epitech","lon":1.448193,"id":13652212,"lat":43.60918,"repinned":false},"rsvp_limit":120,"headcount":0,"visibility":"public","waitlist_count":0,"created":1396608075000,"rating":{"count":8,"average":4.880000114440918},"maybe_rsvp_count":0,"description":"<p>L'association de développeurs Android de Toulouse et Epitech organisent un super événement autour de Google IO et des startups toulousaines à Toulouse le 25 juin 2014.</p> <p>L'event sera co-organisé avec <a href=\"http://www.epitech.eu/toulouse/ecole-informatique-toulouse.aspx\">Epitech</a>, en partenariat avec <a href=\"http://www.digitalplace.fr/\">Digital Place</a> (cluster IT de Toulouse) et sponsorisé par <a href=\"http://software.intel.com/fr-fr/android/\">Intel</a>.</p> <p><b>Présentation de l'événement</b></p> <p>Le nom de la soirée sera : \"IO Extended et les startups toulousaines\". C'est à destination des développeurs, on attend 100 à 120 développeurs.</p> <p><a href=\"http://3.bp.blogspot.com/-IzY9u-OmtUc/U3fAbQGpfcI/AAAAAAAANxs/z94BUzpFaOw/s1600/extended2014-toulouse.png\">&lt;/a&gt; &lt;a href=\"http://3.bp.blogspot.com/-IzY9u-OmtUc/U3fAbQGpfcI/AAAAAAAANxs/z94BUzpFaOw/s1600/extended2014-toulouse.png\"&gt;<img src=\"http://photos2.meetupstatic.com/photos/event/a/2/b/4/600_371621652.jpeg\" /></a></p> <p>Le programme : retransmission des Keynotes, puis des sessions de 18h à minuit :</p> <p><br/>• 17h : Accueil exposants</p> <p>• 17h30 : Accueil participants</p> <p>• 18h - 20h : Keynote</p> <p>• 20h - 22h : Repas / Pitchs Startups </p> <p>• 21h - 22h : Atelier Intel</p> <p>• 22h - 23h : Sessions</p> <p>• <a href=\"https://www.google.com/events/io/schedule/session/9cba49df-b7b3-e311-b30e-00155d5066d7\">What’s New in Android</a></p> <p>• <a href=\"https://www.google.com/events/io/schedule/session/0486a8f4-4acb-e311-b297-00155d5066d7\">Making your Cloud Apps Google-Fast</a></p> <p>• <a href=\"https://www.google.com/events/io/schedule/session/b71bb839-35bc-e311-b297-00155d5066d7\">Polymer &amp; Web Components Change Everything You Know About Web Development</a></p> <p>• 23h - Minuit</p> <p>• <a href=\"https://www.google.com/events/io/schedule/session/47cb220c-07b6-e311-8491-00155d5066d7\">Getting 60 frames-per-second, silky smooth performance on the mobile web</a></p> <p>• <a href=\"https://www.google.com/events/io/schedule/session/743fe228-89c5-e311-b297-00155d5066d7\">Zero to Hero with Google Cloud Platform</a></p> <p>• <a href=\"https://www.google.com/events/io/schedule/session/79edef8b-96d4-e311-b297-00155d5066d7\">Cross-Platform Design</a></p> <p>• <a href=\"https://www.google.com/events/io/schedule/session/825e0a5a-3cbc-e311-b297-00155d5066d7\">The Next Five Billion Gamers</a></p> <p>\n\n\nEn fil rouge, 15 startups viendront présenter leurs technos innovantes très démonstratives. Plusieurs on déjà confirmé leur présence pour tenir un stand de démo : UBleam, CityMéo, Tactic3D, PCB Game, Synox, IdTouch, Audiogaming.</p> <p><br/>Pour que tout ça soit sympa et convivial, nous vous proposerons boissons et nourriture tout le long.</p> <p>On complétera tout ça par de petites animations en fil rouge pour distribuer des Goodies et faire gagner une tablette tactile Galaxy Tab 3 offerte par Intel et BeMyApp.</p> <p>L'objectif de ces deux soirées est de montrer aux développeurs toulousains que sur le bassin, on ne fait pas que de l'informatique lourde pour l'aéronautique, mais qu'on sait aussi utiliser les dernières technologies innovantes pour en sortir des solutions performantes et originales.</p> <p><br/><a href=\"http://3.bp.blogspot.com/-0uN-IPZq1z8/U3fCgC9_K-I/AAAAAAAANxw/HhoPdnXLo1A/s1600/Capture+googleio.PNG\">&lt;/a&gt; &lt;a href=\"http://3.bp.blogspot.com/-0uN-IPZq1z8/U3fCgC9_K-I/AAAAAAAANxw/HhoPdnXLo1A/s1600/Capture+googleio.PNG\"&gt;<a href=\"http://3.bp.blogspot.com/-0uN-IPZq1z8/U3fCgC9_K-I/AAAAAAAANxw/HhoPdnXLo1A/s1600/Capture+googleio.PNG\" class=\"linkified\">http://3.bp.blogspot.com/-0uN-IPZq1z8/U3fCgC9_K-I/AAAAAAAANxw/HhoPdnXLo1A/s1600/Capture+googleio.PNG</a></a></p> <p><br/>Vous l'avez compris c'est un événement pour les pros par les pros, voire pour les développeurs par les développeurs.</p> <p><b>Et vous dans tout ça ?</b></p> <p>Vous voulez assister à l'événement ? Vous êtes au bon endroit. Merci de vous inscrire pour la soirée. Si vous n'êtes pas assuré de venir pour l'instant, inscrivez vous au moins au <a href=\"http://www.meetup.com/Toulouse-Android-User-Group/\">groupe meetup</a>.</p>","event_url":"https://www.meetup.com/GDG-Toulouse/events/175297762/","yes_rsvp_count":120,"duration":18000000,"announced":true,"name":"IO Extended et les startups toulousaines partagent leur passion","id":"175297762","time":"2014-06-25T17:00:00.000Z","updated":1403813145000,"group":{"join_mode":"open","created":1335779291000,"name":"GDG Toulouse","group_lon":1.4500000476837158,"id":3769052,"urlname":"GDG-Toulouse","group_lat":43.619998931884766,"who":"passionnés"},"status":"past"},{"utc_offset":7200000,"venue":{"country":"fr","localized_country_name":"France","city":"Toulouse","address_1":"42 Port Saint-Étienne","name":"Le Seventies","lon":1.456638,"id":21126012,"lat":43.600479,"repinned":false},"rsvp_limit":30,"headcount":0,"visibility":"public","waitlist_count":0,"created":1404312460000,"rating":{"count":2,"average":5},"maybe_rsvp_count":0,"description":"<p>Avec le soleil qui nous annonce un bel été, nous vous proposons de renouveler l'expérience des apéros d'été qui avait eu un franc succès l'an dernier ! Nous vous proposons donc un apéro en centre-ville afin de patienter jusqu’à la prochaine session de septembre. </p> <p>&lt;a href=\"http://1.bp.blogspot.com/-z747sMbPntY/TfiaoVr8qTI/AAAAAAAAAaY/L9x2KUtbBA8/s1600/aperoandroid_nico_small.png\"&gt;&lt;/a&gt;Ce sera l'occasion pour chacun de passer un moment convivial autour d'un verre et d'en connaître un peu plus sur la communauté Android de Toulouse. </p> <p><a href=\"https://images-blogger-opensocial.googleusercontent.com/gadgets/proxy?url=http%3A%2F%2F1.bp.blogspot.com%2F-z747sMbPntY%2FTfiaoVr8qTI%2FAAAAAAAAAaY%2FL9x2KUtbBA8%2Fs200%2Faperoandroid_nico_small.png&amp;container=blogger&amp;gadget=a&amp;rewriteMime=image%2F\" class=\"linkified\">https://images-blogger-opensocial.googleusercontent.com/gadgets/proxy?url=http%3A%2F%2F1.bp.blogspot.com%2F-z747sMbPntY%2FTfiaoVr8qTI%2FAAAAAAAAAaY%2FL9x2KUtbBA8%2Fs200%2Faperoandroid_nico_small.png&amp;container=blogger&amp;gadget=a&amp;rewriteMime=image%2F</a>*</p> <p>Que vous soyez développeurs confirmés ou débutants, professionnels, hackers ou tout simplement curieux d'Android, vous êtes tous les bienvenus ! Ce petit moment nous permettra de parler des évènements passés et à venir mais également de partager nos expériences, astuces et connaissances sur Android.</p> <p>Le lieu vous sera rapidement communiqué.</p> <p>Nous espérons vous voir nombreux !</p>","event_url":"https://www.meetup.com/GDG-Toulouse/events/192589992/","yes_rsvp_count":18,"announced":true,"name":"Les apéros d'été sont de retour !","id":"192589992","time":"2014-07-10T17:00:00.000Z","updated":1405058549000,"group":{"join_mode":"open","created":1335779291000,"name":"GDG Toulouse","group_lon":1.4500000476837158,"id":3769052,"urlname":"GDG-Toulouse","group_lat":43.619998931884766,"who":"passionnés"},"status":"past"},{"utc_offset":7200000,"venue":{"country":"fr","localized_country_name":"France","city":"Toulouse","address_1":"9 Rue du Pont Guilhemery  31000 Toulouse","name":"de danu","lon":1.4578,"id":6371212,"lat":43.601658,"repinned":false},"rsvp_limit":30,"headcount":0,"visibility":"public","waitlist_count":0,"created":1407141505000,"rating":{"count":2,"average":4.5},"maybe_rsvp_count":0,"description":"<p>Avec le soleil qui nous annonce un bel été, nous vous proposons de renouveler l'expérience des apéros d'été qui avait eu un franc succès l'an dernier ! Nous vous proposons donc un apéro en centre-ville afin de patienter jusqu’à la prochaine session de septembre. </p> <p>&lt;a href=\"http://1.bp.blogspot.com/-z747sMbPntY/TfiaoVr8qTI/AAAAAAAAAaY/L9x2KUtbBA8/s1600/aperoandroid_nico_small.png\"&gt;&lt;/a&gt;Ce sera l'occasion pour chacun de passer un moment convivial autour d'un verre et d'en connaître un peu plus sur la communauté Android de Toulouse. </p> <p><a href=\"https://images-blogger-opensocial.googleusercontent.com/gadgets/proxy?url=http%3A%2F%2F1.bp.blogspot.com%2F-z747sMbPntY%2FTfiaoVr8qTI%2FAAAAAAAAAaY%2FL9x2KUtbBA8%2Fs200%2Faperoandroid_nico_small.png&amp;container=blogger&amp;gadget=a&amp;rewriteMime=image%2F\" class=\"linkified\">https://images-blogger-opensocial.googleusercontent.com/gadgets/proxy?url=http%3A%2F%2F1.bp.blogspot.com%2F-z747sMbPntY%2FTfiaoVr8qTI%2FAAAAAAAAAaY%2FL9x2KUtbBA8%2Fs200%2Faperoandroid_nico_small.png&amp;container=blogger&amp;gadget=a&amp;rewriteMime=image%2F</a>*</p> <p>Que vous soyez développeurs confirmés ou débutants, professionnels, hackers ou tout simplement curieux d'Android, vous êtes tous les bienvenus ! Ce petit moment nous permettra de parler des évènements passés et à venir mais également de partager nos expériences, astuces et connaissances sur Android.</p> <p>Le lieu vous sera rapidement communiqué.</p> <p>Nous espérons vous voir nombreux !</p>","event_url":"https://www.meetup.com/GDG-Toulouse/events/198872912/","yes_rsvp_count":16,"duration":10800000,"announced":true,"name":"Les apéros d'été sont de retour en aout !","id":"198872912","time":"2014-08-28T17:00:00.000Z","updated":1409267249000,"group":{"join_mode":"open","created":1335779291000,"name":"GDG Toulouse","group_lon":1.4500000476837158,"id":3769052,"urlname":"GDG-Toulouse","group_lat":43.619998931884766,"who":"passionnés"},"status":"past"},{"utc_offset":7200000,"venue":{"country":"fr","localized_country_name":"France","city":"Toulouse","address_1":" 75 Avenue de Grande Bretagne","name":"ICAM","lon":1.40318,"id":22298072,"lat":43.600201,"repinned":false},"rsvp_limit":60,"headcount":0,"visibility":"public","waitlist_count":0,"created":1409666197000,"rating":{"count":1,"average":5},"maybe_rsvp_count":0,"description":"<p>Première session de la rentrée, l'occasion de remettre la machine en route et de nous revoir après ce \"bel\" été.</p> <p><b>LIEU</b></p> <p><br/>Cette fois-ci, nous serons à l'ICAM :</p> <p><img src=\"http://photos4.meetupstatic.com/photos/event/e/4/5/e/600_408058462.jpeg\" /></p> <p><i>L’Icam est une école d’ingénieur généraliste située sur le site de la Cartoucherie à Toulouse.</i></p> <p><i>Cette formation en 5 ans apporte aux étudiants la méthodologie et les techniques Art et Métiers de l’industrie.</i></p> <p><i>En complément de l’activité pédagogique, l’Icam assure des prestations de Recherche et Développement pour des industriels.</i></p> <p><i>Ces activités portent sur 7 départements : Electronique, Informatique, Productique, Matériaux, Mécanique, Energétique et Sciences Humaines.</i></p> <p><i>Les projets sont réalisés par des futures ingénieurs en dernière année encadrés par des enseignants (docteurs et ingénieurs) qui sont garants du résultat.</i></p> <p><b>SPONSORING</b></p> <p>Personne pour cette fois, mais on aurait quand même des pizzas, c'est pas beau ça ?</p> <p><b>CONTENU</b></p> <p>2 conférences vous seront proposées pour parfaire vos compétences autour du développement Android.</p> <p>Tout d'abord, Laurent Asfaux parlera de domotique et d'objets communicants. Il présentera l'application ImperiHome et son API, ainsi que de l'application Zibase qui permet de transformer un appareil Android avec port USB host en une box domotique. Il y aura aussi quelques infos de base sur Tasker et IFTTT pour faire communiquer des objets entre eux. En cadeau à la fin, petite démo du Sphero, une boule télécommandée qui dispose aussi d'une API.</p> <p>Pour la deuxième conférence, Romain Mouton vous donnera tous les détails sur comment bien utiliser une API REST. Il expliquera ce qu'est une api REST, et comment bien l'implémenter.</p> <p><b>INFO PRATIQUES</b></p> <p>Lieu : ICAM, 75 avenue de Grande-Bretagne</p> <p>Horaire : accueil à partir de 18h45 le jeudi 18 septembre 2014.</p> <p><b>INSCRIPTIONS</b></p> <p>Ne perdez pas de temps, inscrivez vous !</p> <p><b>RAPPELS</b></p> <p>Rappelez vous que nous proposons à toute entreprise de sponsoriser une session pour profiter de la communication de l'événement et de 10 minutes de discours libre en début de session. <br/>Et si vous êtes à la recherche d'un emploi dans le mobile à Toulouse ou possédez une offre, ça se passe sur notre <a href=\"https://groups.google.com/forum/#!forum/taug-emploi\">jobs board</a>.</p>","event_url":"https://www.meetup.com/GDG-Toulouse/events/204648102/","yes_rsvp_count":46,"duration":11700000,"announced":true,"name":"Domotique et objets Communicants, et API Rest","id":"204648102","time":"2014-09-18T16:45:00.000Z","updated":1411077517000,"group":{"join_mode":"open","created":1335779291000,"name":"GDG Toulouse","group_lon":1.4500000476837158,"id":3769052,"urlname":"GDG-Toulouse","group_lat":43.619998931884766,"who":"passionnés"},"status":"past"},{"utc_offset":3600000,"venue":{"country":"fr","localized_country_name":"France","city":"Toulouse","address_1":"40 Boulevard de la Marquette","address_2":"7eme étage","name":"EPITECH","lon":1.429552,"id":22959772,"lat":43.61284,"repinned":false},"rsvp_limit":60,"headcount":0,"visibility":"public","waitlist_count":0,"created":1413403200000,"rating":{"count":2,"average":5},"maybe_rsvp_count":0,"description":"<p>Nous voici de retour ! Nous ne vous parlerons pas d'Android 5.0 Lollipop mais des bonnes pratiques ainsi que de l'in-app purchase. On est un peu à la bourre, donc comme vous le voyez, la date est dans pas longtemps.</p> <p><b>LIEU</b></p> <p>Cette session se déroulera à Epitech :</p> <p><img src=\"http://photos4.meetupstatic.com/photos/event/4/e/1/8/600_341299992.jpeg\" /></p> <p><i><a href=\"http://www.epitech.eu/toulouse/ecole-informatique-toulouse.aspx\">Epitech</a> est aujourd’hui reconnue comme l’une des meilleures écoles d’expertise informatique de haut niveau recherchée par les entreprises. Cette formation repose sur un modèle novateur qui met l’accent sur trois qualités de plus en plus exigées : l’adaptabilité, l’auto-progression, le sens du projet. </i></p> <p><i>Le diplôme d’Epitech est homologué par l’Etat au plus haut niveau (Niveau I) et porté au Registre National des Certifications Professionnelles. L’école est présente dans 12 villes de France.Toutes les informations sur l’école et le réseau sur <a href=\"http://www.epitech.eu/\">leur site</a>.</i></p> <p><b>SPONSORING</b></p> <p>Retour des pizzas ! Merci à notre sponsor de cette session :</p> <p><img src=\"http://photos1.meetupstatic.com/photos/event/d/b/8/600_422103512.jpeg\" /></p> <p><i>Lyra Network est une société Toulousaine spécialisée dans l’acheminement sécurisé des paiements et la mise à disposition de services associés.</i></p> <p><i>Société d’ingénierie logicielle, Lyra Network réalise le développement de solutions métier pour le commerce de proximité, l’e-commerce (PayZen® et ses déclinaisons en marques blanches, utilisées par de nombreuses banques) et  les points de vente mobiles.</i></p> <p><i>Ce sont plus de 25 000 sites e-commerce et 800 000 magasins sur 5 continents qui sont connectés à nos plateformes et administrés par nos soins. Nous leur garantissons une disponibilité de 100% dans le respect des normes de sécurité les plus strictes.</i></p> <p><i>Lyra Network, outre ses performances économiques qui en font un lieu où la créativité et l’innovation peuvent s’exprimer sans contraintes, promeut la culture de l’excellence et soutient les communautés de développeurs impliqués dans la construction des services de demain.</i></p> <p><a href=\"http://www.lyra-network.com\">www.lyra-network.com</a></p> <p><b>CONTENU</b></p> <p>2 conférences au programme pour parfaire vos compétences autour du développement Android.</p> <p>Tout d'abord un habitué avec Mathias Séguy, fondateur de la société Android2EE, vous exposera les bonnes pratiques Android. Il vous adresse un message, une invitation que vous ne pouvez pas refuser :</p> <p><i>\"Toi, oui, toi, le développeur Android, expert ou débutant, prends ton billet, je t'emmène.</p> <p>Je te propose un périple au sein du monde du développement Android. Je te parlerai de Design et d'UX, de techniques de dev, d'asynchronicité et de sécurité, de bonnes pratiques, d'architecture, de librairies, de stratégies réseau... et de bien d'autres choses encore. De tous ces détails qui font qu'une application devient une application d'excellence.</p> <p>Simple matelot ou capitaine de navire, ne laisse pas passer ce voyage, il t'ouvrira de nouvelles voies du monde Android.\"</i></p> <p><i><br/></i></p> <p>Pour la deuxième conférence, Pierre Benayoun du <a href=\"http://baug.fr/\">BAUG</a> vous parlera de l'in-app purchase :</p> <p>\"Comment je ne suis pas devenu milliardaire\"</p> <p><br/>En se basant sur son expérience personnelle, Pierre  viendra échanger sur les questions suivantes :</p> <p>- Quels modèles pour se rémunérer grâce à son ou ses applications ? Publicité, Google play, rachat, autopromotion ?</p> <p><br/>- Du prix de vente à son compte en banque. Comment estimer ses revenus réels ?</p> <p><br/>- Google adView et  In App Billing du rêve à la réalité, comment les intégrer sans trop en ch...</p> <p>\n\n\n<b>INFOS PRATIQUES</b></p> <p>Attention, les locaux d'EPITECH ont changé. Ils sont maintenant au 40 boulevard de la marquette</p> <p>Horaire : accueil à partir de 18h45 le lundi 27 octobre 2014.</p> <p><b>INSCRIPTIONS</b></p> <p>Ne perdez pas de temps, inscrivez-vous !</p> <p><b>RAPPELS</b></p> <p>Rappelez-vous que nous proposons à toute entreprise de sponsoriser une session pour profiter de la communication de l'événement et de 10 minutes de discours libre en début de session. </p>","event_url":"https://www.meetup.com/GDG-Toulouse/events/213644852/","yes_rsvp_count":54,"duration":10800000,"announced":true,"name":"Les bonnes pratiques et l'in-app purchase","id":"213644852","time":"2014-10-27T18:00:00.000Z","updated":1414486886000,"group":{"join_mode":"open","created":1335779291000,"name":"GDG Toulouse","group_lon":1.4500000476837158,"id":3769052,"urlname":"GDG-Toulouse","group_lat":43.619998931884766,"who":"passionnés"},"status":"past"},{"utc_offset":3600000,"venue":{"country":"fr","localized_country_name":"France","city":"Toulouse","address_1":"40 Boulevard de la Marquette","address_2":"7eme étage","name":"EPITECH","lon":1.429552,"id":22959772,"lat":43.61284,"repinned":false},"rsvp_limit":80,"headcount":0,"visibility":"public","waitlist_count":0,"created":1417098433000,"rating":{"count":0,"average":0},"maybe_rsvp_count":0,"description":"<p>Et c'est parti pour le dernier meetup Android de l'année ! Aujourd'hui au menu : de l'expérience utilisateur avec <b>Olivier Ramon</b> et <b>Anthony Monteiro</b>.</p> <p><b>LIEU</b></p> <p>Pour cette session de fin d'année, on se retrouvera à <b>Epitech</b> !</p> <p><br/><img src=\"http://photos4.meetupstatic.com/photos/event/8/0/6/8/600_280832872.jpeg\" /></p> <p><i><a href=\"http://www.epitech.eu/toulouse/ecole-informatique-toulouse.aspx\">Epitech</a> est aujourd’hui reconnue comme l’une des meilleures écoles d’expertise informatique de haut niveau recherchée par les entreprises. Cette formation repose sur un modèle novateur qui met l’accent sur trois qualités de plus en plus exigées : l’adaptabilité, l’auto-progression, le sens du projet. </i></p> <p><i>Le diplôme d’Epitech est homologué par l’Etat au plus haut niveau (Niveau I) et porté au Registre National des Certifications Professionnelles. L’école est présente dans 12 villes de France.Toutes les informations sur l’école et le réseau sur <a href=\"http://www.epitech.eu/\">leur site</a>.</i></p> <p><b>SPONSORING</b></p> <p>On remerciera <b>Illicar</b>, qui va sponsoriser cette session</p> <p><img src=\"http://photos3.meetupstatic.com/photos/event/a/3/4/c/600_431921804.jpeg\" /></p> <p><i>Illicar est une application de covoiturage qui consiste en la mise en relation deux personnes (un conducteur et un passager) en temps réel et en milieu urbain et extra urbain. Le passager est alors amené à son adresse de destination moyennant une donation suggérée.</i></p> <p><i>L'objectif étant d’offrir un mode de transport alternatif aux modes de déplacements conventionnels et établis, de combler une lacune d’offre dans des zones géographiques délaissées ainsi qu’offrir un transport sécurisé pour ses utilisateurs.</i></p> <p><i>Dans le cadre de son développement, nous recherchons un développeur (débutant accepté / bac +3, +4, +5) ayant des compétences java et Android.</i></p> <p><br/><i>Notions obligatoires :<br/>- Rest<br/>- Spring<br/>- Maven<br/>- Android<br/>Notions facultatives : <br/>- node.js<br/>- Tomcat<br/>- Oauth2<br/>- websocket<br/></i></p> <p><i>Intégration possible sous forme de stage, CDI ou prise de participation en fonction des profils et motivations.</i></p> <p><i>Pour plus d'informations, contact au 06 17 77 52 25 ou par mail (xave244@gmail.com).</i></p> <p><b>CONTENU</b></p> <p>La première conférence sera présentée par <b>Olivier</b>, qui va nous expliquer, d'un point de vue un petit peu théorique, pourquoi et comment l'utilisateur doit être présent pendant la conception d'application, avant de présenter les principes de l'ergonomie dans l'informatique.</p> <p>Ensuite, c'est <b>Anthony</b>, qui va rentrer plus dans la technique et nous raconter comment travailler avec un graphiste. Il nous montrera ensuite comment réaliser des jolies applications, en explorant un peu le Material Design, et les animations.</p> <p><b>INFOS PRATIQUES</b></p> <p>Attention, les locaux d'EPITECH ont changé. Ils sont maintenant au 40 boulevard de la marquette</p> <p>Horaire : accueil à partir de 18h45 le jeudi 18 décembre 2014.</p> <p><b>INSCRIPTIONS</b></p> <p>Ne perdez pas de temps, inscrivez-vous !</p> <p><b>RAPPELS</b></p> <p>Rappelez-vous que nous proposons à toute entreprise de sponsoriser une session pour profiter de la communication de l'événement et de 10 minutes de discours libre en début de session. </p>","event_url":"https://www.meetup.com/GDG-Toulouse/events/218926416/","yes_rsvp_count":41,"announced":true,"name":"Android & User Experience","id":"218926416","time":"2014-12-18T18:00:00.000Z","updated":1418937570000,"group":{"join_mode":"open","created":1335779291000,"name":"GDG Toulouse","group_lon":1.4500000476837158,"id":3769052,"urlname":"GDG-Toulouse","group_lat":43.619998931884766,"who":"passionnés"},"status":"past"},{"utc_offset":3600000,"venue":{"country":"fr","localized_country_name":"France","city":"Toulouse","phone":" 05 32 10 81 27 ","address_1":"27 Rue d'Aubuisson","name":"La Cantine","lon":1.454036,"id":11215992,"lat":43.602768,"repinned":false},"rsvp_limit":60,"headcount":53,"visibility":"public","waitlist_count":0,"created":1418988547000,"rating":{"count":4,"average":5},"maybe_rsvp_count":0,"description":"<p>Messieurs dames bonjour !</p> <p>Nous espérons que vos fêtes de fin d'années se passent bien, et on va attaquer fort cette nouvelle année 2015 avec deux sujet super chouettes et un sponsor bien connu !</p> <p><b>LIEU</b></p> <p><img src=\"http://lacantine-toulouse.org/static/img/logoheader.png\" /></p> <p><a href=\"http://lacantine-toulouse.org/\">La Cantine</a> nous accueille une nouvelle fois dans leur espace de co-working !</p> <p><i>Agitateur d’idées, La Cantine est avant tout un lieu d’échange, de rencontres et d’expérimentation ouvert à tous les curieux et passionnés du Numérique. La pluralité des profils et parcours des visiteurs fait de La Cantine un espace d’intense brassage. De ceux qui y passent une journée entière à y travailler à ceux qui décident d’y suivre une formation de quelques heures : tous y sont réunis dans un même esprit à la fois sérieux et convivial. Y passer le temps d’un simple café pris sur le pouce, c’est déjà s’offrir une opportunité de côtoyer le quotidien des nouvelles tendances numériques.</i></p> <p><b>SPONSOR</b></p> <p><img src=\"http://photos1.meetupstatic.com/photos/event/4/e/6/600_432601254.jpeg\" /></p> <p><a href=\"http://www.microsoft.com/fr-fr/default.aspx\">Microsoft</a> sera notre sponsor pour cette session</p> <p><i>Après une collaboration remarquée lors de la sublime DroidCon 2014, Microsoft est heureux de participer à l’animation de la communauté des développeurs Toulousains au côté du TAUG. Accompagner des projets, partager nos idées, échanger nos points  de vues et notre passion pour le code fait partie intégrante de notre ADN.</i></p> <p>\n\n\n<b>CONTENU</b></p> <p>La première conférence sur <b><i>Android Wear</i></b> sera présentée par <b>Nicolas Pomepuy</b>:</p> <p><i>A l'heure ou objets connectés sont présentés comme la prochaine révolution numérique, les smartwatches commencent à se démocratiser. En lançant Android Wear lors de la dernière Google IO, Google a voulu se placer en leader sur ce marché. <br/>En tant que développeur, cette nouvelle plateforme représente un nouvel enjeu. Ajouter des fonctionnalités Wear à votre application peut vous permettre de la différencier ainsi que vous apporter de nouveaux marchés. <br/>Lors de cette session, je vous présenterai la plateforme et vous donnerai les clés aussi bien technique qu'en terme d'expérience utilisateur pour intégrer Android Wear à votre application.</i></p> <p><br/>Puis , c'est <b>Alex Danvy</b>, qui enchaine avec <i><b>Xamarin</b></i>.</p> <p><i>Avoir une offre multiplateforme est une aspiration des clients et des utilisateurs. Décrié par les certains développeurs, adulé par les autres. Faisons un tour d’horizon des solutions à notre disposition et attardons sur l’une d’elle, qui gagne particulièrement à être connue : Xamarin. Se voulant sans compromis, forte réutilisation du code et applications natives, qu’en est-il réellement de cette promesse ?</i></p> <p><br/><b>INFOS PRATIQUES</b></p> <p>Métro: Ligne B - François Verdier / Lignes A et B - Jean-Jaurès</p> <p><br/>Vélo Toulouse : station en face de La Cantine Toulouse</p> <p><br/>Parking Saint Aubin</p> <p><br/>mobi lib' station François Verdier</p> <p>\n\n\n\n<b>INSCRIPTIONS</b></p> <p>Ne perdez pas de temps, inscrivez-vous !</p> <p><b>RAPPELS</b></p> <p>Rappelez-vous que nous proposons à toute entreprise de sponsoriser une session pour profiter de la communication de l'événement et de 10 minutes de discours libre en début de session.</p>","event_url":"https://www.meetup.com/GDG-Toulouse/events/219329492/","yes_rsvp_count":54,"duration":10800000,"announced":true,"name":"Android Wear & Cross-dev avec Xamarin","id":"219329492","time":"2015-01-12T18:00:00.000Z","updated":1422432255000,"group":{"join_mode":"open","created":1335779291000,"name":"GDG Toulouse","group_lon":1.4500000476837158,"id":3769052,"urlname":"GDG-Toulouse","group_lat":43.619998931884766,"who":"passionnés"},"status":"past"},{"utc_offset":7200000,"venue":{"country":"fr","localized_country_name":"France","city":"Toulouse","address_1":"14 rue Claire Pauilhac","name":"ISEG","lon":1.444999,"id":23702283,"lat":43.610996,"repinned":false},"rsvp_limit":160,"headcount":0,"visibility":"public","waitlist_count":0,"created":1428924801000,"rating":{"count":10,"average":4.599999904632568},"maybe_rsvp_count":0,"description":"<p>Comme l'année dernière, le Toulouse Android User Group retransmettra la Keynote de <b>Google IO</b>. Toutes les infos de l'événement à San Francisco sont ici : <a href=\"https://events.google.com/io2015\"><a href=\"https://events.google.com/io2015\" class=\"linkified\">https://events.google.com/io2015</a></a></p> <p><br/>Google retransmet depuis plusieurs années <b>en direct</b> la keynote et la majorité des conférences via Youtube. Le <a href=\"https://developers.google.com/groups/\">réseau des GDGs</a> est là pour fédérer en local les développeurs qui veulent regarder ces retransmissions ensemble.</p> <p>A Toulouse, le <b>Toulouse Android User Group</b> vous propose de faire plus. Nous retransmettrons bien la Keynote ainsi que quelques conférences. Mais en plus, <b>20 startups et projets innovants</b> viendront vous présenter <b>leurs innovation</b>s par l'angle technique, et plus de 30 porteurs de projet viendront <b>pitcher en 1 minute</b>.</p> <p>Pour rendre tout cela le plus convivial possible et pour tenir la soirée, nous proposerons un cocktail avec charcuterie, fromage, vin et bières.</p> <p><b><br/></b></p> <p><b>Les sponsors</b></p> <p>Afin de rendre cette soirée possible, plusieurs acteurs toulousains ont décidé de nous aider.</p> <p><i>Sponsor Premium</i></p> <p>Toulouse Métropôle. La communauté d'agglomération a décidé de participer à cet soirée dans le cadre de French Tech Toulouse. Toulouse fait partie des villes française labellisées French Tech afin de promouvoir l'innovation, les startups et le numérique en France.</p> <p><img src=\"http://photos4.meetupstatic.com/photos/event/b/0/e/f/600_437085295.jpeg\" /></p> <p><img src=\"http://photos4.meetupstatic.com/photos/event/b/1/0/2/600_437085314.jpeg\" /></p> <p><i>Co-organisateurs</i></p> <p>Pour cette année encore, <a href=\"http://www.epitech.eu/toulouse/ecole-informatique-toulouse.aspx\">Epitech Toulouse</a> nous aide à organiser cette soirée.. Merci à eux.</p> <p>Epitech est une école d'informatique créée en 1999 qui forme en 5 ans après-bac des experts du secteur. Elle permet de transformer une passion en expertise via une pédagogie résolument innovante, organisée par projets.</p> <p><br/><img src=\"http://photos4.meetupstatic.com/photos/event/8/0/6/8/600_280832872.jpeg\" /></p> <p><br/><i>Sponsors Gold</i></p> <p>• <a href=\"http://fr.fittingbox.com\">FittingBox</a>. Cette startups développe et commercialise des solutions d'essayage virtuel afin de stimuler et d'accroitre la vente de lunettes aussi bien en ligne qu'en magasin. </p> <p><img src=\"http://photos2.meetupstatic.com/photos/event/b/1/4/c/600_437085388.jpeg\" /></p> <p>• <a href=\"http://www.intuilab.com/\">IntuiLab</a> makes IntuiFace, a platform for creating interactive, connected and rich experiences without coding that runs everywhere.</p> <p><br/><img src=\"http://photos2.meetupstatic.com/photos/event/b/1/6/a/600_437085418.jpeg\" /></p> <p>• DigitalPlace. le cluster d’entreprises numériques de la Région Midi-Pyrénées. Ensemble, accélérons la dynamique de nos entreprises !</p> <p><img src=\"http://photos3.meetupstatic.com/photos/event/b/2/0/3/600_437085571.jpeg\" /></p> <p><b><br/></b></p> <p><b>Les startups et projets innovants à rencontrer</b></p> <p><br/>En plus de nos sponsors, venez rencontrer les entreprises et leurs démos :</p> <p>• Aestetype, SocialWall</p> <p>• CityMeo, Ecran d'informations dynamique</p> <p>• Micronutris, Produits à base d'insects</p> <p>• Unitag, Solution de markting mobile</p> <p>• FittingBox, Leaders in interactive solutions for the eyewear industry</p> <p>• IntuiLab, IntuiLab a développé un framework « hybride » HTML5/Cordoba pour créer des applications front-end interactives</p> <p>• BonneMangeoire, une Mangeoire qui va prendre en photo l'oiseau qui se pose et Tweeter directement la photo</p> <p>• Demooz, Demooz, la communauté en ligne qui permet de choisir le bon produit. Posez vos questions ou venez le tester avec un particulier qui le possède déjà !</p> <p>• Ubixr, Le réseau collaboratif qui fonctionne comme un jeu de cartes !</p> <p>• Unooc, Comparateur de médicaments en ligne</p> <p>• quelques projets innovants par les étudiants de Epitech et l'ICAM</p> <p><b><br/></b></p> <p><b>Le programme</b></p> <p>Peut évoluer un peu dans les prochains jours :</p> <p>• 17h : Ouverture des portes</p> <p>• 17h45 : Présentation de la soirée</p> <p>• 18h - 20h : Keynote Google</p> <p>• 20h : Le mot de Toulouse Métropôle</p> <p>• 20h10 : Cocktail et ouverture de l'accès aux stands</p> <p>• 20h30 - 21h30 : Pitchs des projets</p> <p>• 21h - Minuit : Retransmission des sessions IO</p> <p>• Minuit : Fermeture</p> <p>\n\n\nInscrivez vous dès à présent.</p>","event_url":"https://www.meetup.com/GDG-Toulouse/events/221808977/","yes_rsvp_count":155,"duration":25200000,"announced":true,"name":"IO Extended et les startups toulousaines #2","id":"221808977","time":"2015-05-28T15:00:00.000Z","updated":1433255865000,"group":{"join_mode":"open","created":1335779291000,"name":"GDG Toulouse","group_lon":1.4500000476837158,"id":3769052,"urlname":"GDG-Toulouse","group_lat":43.619998931884766,"who":"passionnés"},"status":"past"},{"utc_offset":7200000,"venue":{"country":"fr","localized_country_name":"France","city":"Toulouse","address_1":"42 Port Saint-Étienne","name":"Le Seventies","lon":1.456638,"id":21126012,"lat":43.600479,"repinned":false},"headcount":0,"visibility":"public","waitlist_count":0,"created":1436126478000,"rating":{"count":1,"average":5},"maybe_rsvp_count":0,"description":"<p>Les apéros d'été sont de retour !</p> <p>Le soleil est de retour depuis quelques semaines. Avec lui, c'est maintenant une tradition, <b>les apéros d'été du TAUG. </b></p> <p>Nous vous proposons de renouveler l'expérience des apéros d'été qui avait eu un franc succès les années précédentes  !</p> <p><a href=\"https://images.duckduckgo.com/iu/?u=http%3A%2F%2Fmedia-cache-ec0.pinimg.com%2F736x%2F28%2Ffa%2Fac%2F28faacf3171b359fc290f9e204a7468c.jpg&amp;f=1\" class=\"linkified\">https://images.duckduckgo.com/iu/?u=http%3A%2F%2Fmedia-cache-ec0.pinimg.com%2F736x%2F28%2Ffa%2Fac%2F28faacf3171b359fc290f9e204a7468c.jpg&amp;f=1</a></p> <p>Ce sera l'occasion pour chacun de passer un moment convivial autour d'un verre et d'en connaître un peu plus sur la communauté Android/Google de Toulouse en attendant le retour des conférences à la rentrée.</p> <p>\n\n\nCes apéros sont ouverts à toutes et à tous, quel que soit votre niveau : <b>débutants, confirmés, (appleAddict) voire même simple curieux.</b> Venez partager avec nous un petit moment sympathique basé sur l'échange, la rencontre et la convivialité.</p> <p>Ce petit moment nous permettra de parler des évènements passés et à venir mais également de partager nos expériences, astuces et connaissances sur Android.</p> <p>Pour la première tournée,<b><i> rendez-vous le mercredi 15 juillet au Seventies (métro F.Verdier) à partir de 19h.</i></b></p>","event_url":"https://www.meetup.com/GDG-Toulouse/events/223719898/","yes_rsvp_count":14,"announced":true,"name":"Les apéros d'été sont de retour en Juillet !","id":"223719898","time":"2015-07-15T17:00:00.000Z","updated":1436998199000,"group":{"join_mode":"open","created":1335779291000,"name":"GDG Toulouse","group_lon":1.4500000476837158,"id":3769052,"urlname":"GDG-Toulouse","group_lat":43.619998931884766,"who":"passionnés"},"status":"past"},{"utc_offset":7200000,"venue":{"country":"fr","localized_country_name":"France","city":"Toulouse","address_1":"9 Rue du Pont Guilhemery  31000 Toulouse","name":"de danu","lon":1.4578,"id":6371212,"lat":43.601658,"repinned":false},"headcount":15,"visibility":"public","waitlist_count":0,"created":1438009860000,"rating":{"count":2,"average":5},"maybe_rsvp_count":0,"description":"<p>Les apéros d'été sont de re-retour en Août !</p> <p>Le mois de juillet se termine et on se rapproche à grands pas de la rentrée ! </p> <p>Certains doivent déjà paniquer à l'idée de devoir finir leur cahier de vacances \"How to be an Android master in 4 weeks\" ou encore \"How to find a purpose with my Google Glass ?\". Mais je suis certain que d'autres sont ravis à l'idée de reprendre le chemin des TAUG, remplis de speakers, de sujets intéressants et de gentils TAUGEURS (ou TAUGISTES... c'est vous qui voyez).</p> <p>\n\n<b>Les apéros d'été du TAUG </b>continuent donc sur leur lancée ! Après l'événement réussi de début juillet qui a réuni une bonne dizaine de passionnés (du débutant, au freelance en passant par le dév étudiant), nous remettons le couvert afin de rencontrer les petits nouveaux qui seraient encore cachés derrière Android Studio.</p> <p>Pour la seconde tournée,<b><i> rendez-vous le mercredi 26  août au Seventies (métro F.Verdier) à partir de 19h.</i></b></p> <p>\n\n\n<img src=\"http://photos1.meetupstatic.com/photos/event/9/0/1/8/600_440256888.jpeg\" /></p> <p>Parlez en à un maximum de monde. Ces apéros sont ouverts à toutes et à tous, quel que soit votre niveau : <b>débutants, confirmés, (appleAddict) voire même simples curieux.</b> </p> <p>L'objectif est de se rencontrer et de prendre le temps de faire connaissance dans un cadre décontracté et informel.</p>","event_url":"https://www.meetup.com/GDG-Toulouse/events/224207489/","yes_rsvp_count":15,"announced":true,"name":"Les apéros d'été sont de re-retour en Août !","id":"224207489","time":"2015-08-26T17:00:00.000Z","updated":1440634632000,"group":{"join_mode":"open","created":1335779291000,"name":"GDG Toulouse","group_lon":1.4500000476837158,"id":3769052,"urlname":"GDG-Toulouse","group_lat":43.619998931884766,"who":"passionnés"},"status":"past"},{"utc_offset":7200000,"venue":{"country":"fr","localized_country_name":"France","city":"31670 Labège","address_1":"425, rue Jean Rostand","name":"IOT Valley","lon":1.511655,"id":24090955,"lat":43.543823,"repinned":false},"rsvp_limit":1,"headcount":0,"visibility":"public","waitlist_count":6,"created":1442227227000,"rating":{"count":0,"average":0},"maybe_rsvp_count":0,"description":"<p>Pour cette rentrée 2015, le Toulouse Android User Group a décidé de s'associer à un bel événement de notre agglomération : \"Innovation Days 3\" de l'IOT Valley. </p> <p><img src=\"http://photos4.meetupstatic.com/photos/event/4/e/0/0/600_441979968.jpeg\" /></p> <p>Du coup, le format habituel a un peu changé. La conférence aura lieu entre 12h00 et 12h40 à l'IOT Valley.</p> <p>\n\n\n\nLa conférence \"VR avec le Cardboard SDK, OpenGL ES 2.0, shaders avec GLSL\" sera assurée par Gregory Estrade. Au programme, Gregory vous expliquera comment vous lancer dans le développement d'applications Android pour le casque de réalité virtuelle en carton (sans jeu de mot ;) ) de Google. Vous y apprendrez au passages quelques notions sur la 3D avec OpenGL ES 2.0, et le développements de shaders en GLSL.</p> <p>\n\n\nEt comme il n'y aura pas que cette conférence, vous pouvez aussi vous inscrire à d'autres conférences de cette journée. 3 thématiques seront abordées : retours d'expériences de startups sur leur activité, conférences techniques IoT et conférences générales autour de l'IOT.</p> <p>Quelques exemples :</p> <p>• AIRBUS / SCENTYS, L'aéronautique, un secteur intouchable pour les startups ?</p> <p><br/>• INTESENS / SNCF, Comment l'iOT va révolutionner la maintenance ferroviaire ?</p> <p><br/>• La carte MAREN : référence design pour les applications IOT, permettant de débuter rapidement les essais fonctionnels</p> <p><br/>• Beacon et géolocalisation indoor, quand le visiteur devient connecté.</p> <p>\n\n\n\nTout le programme est disponible ici : <a href=\"https://uploads.strikinglycdn.com/files/127393/912abfe8-df81-4849-ad95-01b5c9fd45f5/programme.pdf\">programme.pdf</a></p> <p>\n\n\nExceptionnellement, les inscriptions se passent ici : <a href=\"https://innovation-days.eventcube.io/events/2514/innovation-days-2015/\"><a href=\"https://innovation-days.eventcube.io/events/2514/innovation-days-2015/\" class=\"linkified\">https://innovation-days.eventcube.io/events/2514/innovation-days-2015/</a></a></p>","event_url":"https://www.meetup.com/GDG-Toulouse/events/225341740/","yes_rsvp_count":1,"duration":2700000,"announced":true,"name":"Conférence spéciale à Innovation Days : VR avec le Cardboard SDK","id":"225341740","time":"2015-09-24T10:00:00.000Z","updated":1443092817000,"group":{"join_mode":"open","created":1335779291000,"name":"GDG Toulouse","group_lon":1.4500000476837158,"id":3769052,"urlname":"GDG-Toulouse","group_lat":43.619998931884766,"who":"passionnés"},"status":"past"},{"utc_offset":7200000,"venue":{"country":"fr","localized_country_name":"France","city":"Toulouse","phone":" 05 32 10 81 27 ","address_1":"27 Rue d'Aubuisson","name":"La Cantine","lon":1.454036,"id":11215992,"lat":43.602768,"repinned":false},"rsvp_limit":80,"headcount":0,"visibility":"public","waitlist_count":0,"created":1443715351000,"rating":{"count":6,"average":4.329999923706055},"maybe_rsvp_count":0,"description":"<p>Bonjour à tous,</p> <p>Tandis que l'automne arrive doucement et nous refroidit peu à peu les miches, nous sommes très heureux d'annoncer la prochaine session TAUG avec 2 sujets super intéressants qui devraient vous réchauffer.</p> <p>\n\n\n<b>LIEU</b></p> <p><img src=\"http://lacantine-toulouse.org/static/img/logoheader.png\" /></p> <p><a href=\"http://lacantine-toulouse.org/\">La Cantine </a>nous accueillera dans son espace de co-working ! Merci à eux.</p> <p><br/><b><br/></b></p> <p><b>SPONSOR</b></p> <p><img src=\"http://photos1.meetupstatic.com/photos/event/d/b/8/600_422103512.jpeg\" /></p> <p>Lyra Network, expert en solution de paiement, accompagne plus de 30 000 sites e-commerce et 1,5 millions de points de vente à travers le monde. Ses 14 années d’expérience en ont fait un leader en France en part de marché et dans le lancement de nouveaux services innovants. <a href=\"http://www.lyra-network.com/\">www.lyra-network.com</a></p> <p>\n\n\n\n<b>CONTENU</b></p> <p>Si vous êtes curieux, vous allez adorer cette session puisque nous partons à la découverte de deux univers.</p> <p><b><br/></b></p> <p><b># Android 6.0 Marshmallow #</b></p> <p><br/>La première conférence sera animée par Julien Del Rio. Il présentera la nouvelle version d<b>'Android Marshmallow.</b></p> <p><img src=\"http://www.technodistro.com/wp-content/uploads/2015/08/Download-Android-6.0-Marshmallow.jpg\" /></p> <p><b><br/></b></p> <p><b># Le langage Go #</b></p> <p><br/>Le second sujet sera présenté par Sylvain Wallez, responsable Iot Chez OVH. Sylvain nous emmènera à la découverte du langage Go, un langage développé par Google.</p> <p><br/><img src=\"http://insights.dice.com/wp-content/uploads/2012/03/google-go-logo.jpg\" /></p> <p><b><br/></b></p> <p><b>INFOS PRATIQUES</b></p> <p>Métro: Ligne B - François Verdier / Lignes A et B - Jean-Jaurès</p> <p>Vélo Toulouse : station en face de La Cantine Toulouse</p> <p>Parking Saint Aubin</p> <p>mobi lib' station François Verdier</p> <p><b>INSCRIPTIONS</b></p> <p>Ne perdez pas de temps, inscrivez-vous !</p> <p><b>RAPPELS</b></p> <p>Rappelez-vous que nous proposons à toute entreprise de sponsoriser une session pour profiter de la communication de l'événement et de 10 minutes de discours libre en début de session.</p>","event_url":"https://www.meetup.com/GDG-Toulouse/events/225754405/","yes_rsvp_count":73,"announced":true,"name":"Android Marshmallow & découverte du langage Go","id":"225754405","time":"2015-10-22T17:00:00.000Z","updated":1445765956000,"group":{"join_mode":"open","created":1335779291000,"name":"GDG Toulouse","group_lon":1.4500000476837158,"id":3769052,"urlname":"GDG-Toulouse","group_lat":43.619998931884766,"who":"passionnés"},"status":"past"},{"utc_offset":3600000,"venue":{"country":"fr","localized_country_name":"France","city":"Toulouse","address_1":"40 Boulevard de la Marquette","name":"EPITECH","lon":1.429108,"id":24248807,"lat":43.612438,"repinned":false},"rsvp_limit":80,"headcount":58,"visibility":"public","waitlist_count":0,"created":1447926819000,"rating":{"count":4,"average":5},"maybe_rsvp_count":0,"description":"<p>C’est la dernière de l’année et vous allez bientôt goûter à la bûche et découvrir vos jouets par millier. Mais avant cela, le <b>TAUG</b> vous propose deux conférences qui, nous sommes sûrs, vont vous intéresser.</p> <p>\n\n<b>Lieu</b></p> <p><img src=\"http://photos4.meetupstatic.com/photos/event/4/2/3/7/600_444496951.jpeg\" /></p> <p>Merci à <a href=\"http://www.epitech.eu/\"><b>Epitech</b></a> de nous accueillir sur le campus de la Marquette, 4eme étage. Le code pour entrer : 5458.</p> <p><b>Sponsor</b></p> <p>Nous n'avons pas de sponsor pour cette session, vous trouverez toutes les informations pour sponsoriser à cette adresse : <a href=\"https://goo.gl/uifR4j\"><a href=\"https://goo.gl/uifR4j\" class=\"linkified\">https://goo.gl/uifR4j</a></a></p> <p><br/><b>Contenu</b></p> <p>• <b>Synchronisation d’applications mobiles via Couchbase</b></p> <p>Tout d’abord, <b>Emmanuel Vinas</b>, expert Android et web chez MonkeyPatch va nous présenter la synchronisation d’applications mobiles via Couchbase mobile. la présentation se terminera par un live-coding.</p> <p><br/><img src=\"http://photos2.meetupstatic.com/photos/event/4/1/f/c/600_444496892.jpeg\" /></p> <p>\n\n\n\n• <b>Le langage GO</b></p> <p>Ensuite, <b>Sylvain Wallez</b>, responsable Iot Chez OVH vous fera une présentation du langage GO, le langage de Google utilisé par Docker par exemple.</p> <p><img src=\"http://photos4.meetupstatic.com/photos/event/4/2/1/b/600_444496923.jpeg\" /></p> <p><br/><b>INFOS PRATIQUES</b></p> <p><img src=\"http://photos3.meetupstatic.com/photos/event/4/2/3/2/600_444496946.jpeg\" /></p> <p>Métro: Ligne B - Canal du midi - Compans Caffarelli</p> <p>\n\n<b>RAPPELS</b></p> <p>Rappelez-vous que nous proposons à toute entreprise de sponsoriser une session pour profiter de la communication de l'événement et de 10 minutes de discours libre en début de session.</p>","how_to_find_us":"4ème étage. Code: 5458.","event_url":"https://www.meetup.com/GDG-Toulouse/events/226880586/","yes_rsvp_count":58,"announced":true,"name":"Découverte de Go (rattrapage d'octobre) et la synchro de donnée via CouchBase","id":"226880586","time":"2015-12-10T17:45:00.000Z","updated":1449813334000,"group":{"join_mode":"open","created":1335779291000,"name":"GDG Toulouse","group_lon":1.4500000476837158,"id":3769052,"urlname":"GDG-Toulouse","group_lat":43.619998931884766,"who":"passionnés"},"status":"past"},{"utc_offset":3600000,"venue":{"country":"fr","localized_country_name":"France","city":"Toulouse","phone":" 05 32 10 81 27 ","address_1":"27 Rue d'Aubuisson","name":"La Cantine","lon":1.454036,"id":11215992,"lat":43.602768,"repinned":false},"rsvp_limit":70,"headcount":55,"visibility":"public","waitlist_count":0,"created":1453205690000,"rating":{"count":7,"average":4.860000133514404},"maybe_rsvp_count":0,"description":"<p>Bonjour à tous et très bonne année 2016 !</p> <p>Tout le TAUG vous souhaite beaucoup de réussite et de release dans vos tous vos projets (Android, iOS et même Windows Phone).</p> <p><img src=\"http://photos4.meetupstatic.com/photos/event/5/3/0/8/600_446061256.jpeg\" /></p> <p><b>Lieu</b></p> <p>Merci à <b><a href=\"http://lacantine-toulouse.org/\">La Cantine Numérique</a> </b>de nous accueillir rue D'Aubuisson (Métro JJaurès).</p> <p><img src=\"http://photos2.meetupstatic.com/photos/event/2/4/f/3/600_446289459.jpeg\" /></p> <p><b>Sponsor</b></p> <p>Nous n'avons pas de sponsor pour cette session, vous trouverez toutes les informations pour sponsoriser à cette adresse : <a href=\"https://goo.gl/uifR4j\"><a href=\"https://goo.gl/uifR4j\" class=\"linkified\">https://goo.gl/uifR4j</a></a></p> <p>\n\n\n<b>Contenu</b></p> <p>Pour cette première session 2016, nous accueillons 3 speakers pour présenter deux bibliothèques développées par <b>Square </b>et une initiation aux API RESTful :</p> <p><br/>- Julien Del Rio présentera l'incontournable <a href=\"http://square.github.io/retrofit/\">RetroFit</a> :<br/><b>\"Ne faites plus un seul appel réseau sans Retrofit\"</b></p> <p>- Emmanuel Vinas nous dira comment <b>détecter les fuites mémoires</b> avec <a href=\"https://github.com/square/leakcanary\">LeakCanary</a></p> <p>- <b>Guilhem</b>, développeur chez Payname, présentera le processus de développement de leur app Android : les libraries, Gradle ... Un témoignage riche en technologies et en retour d'expérience.</p> <p>\n\n\n\n\n\n\n<b>INFOS PRATIQUES</b></p> <p>Métro: Ligne B - François Verdier / Lignes A et B - Jean-Jaurès</p> <p>Vélo Toulouse : station en face de La Cantine Toulouse</p> <p>Parking Saint Aubin</p> <p>mobi lib' station François Verdier</p> <p><b>INSCRIPTIONS</b></p> <p>Ne perdez pas de temps, inscrivez-vous !</p> <p><b>RAPPELS</b></p> <p>Rappelez-vous que nous proposons à toute entreprise de sponsoriser une session pour profiter de la communication de l'événement et de 10 minutes de discours libre en début de session.</p>","how_to_find_us":"Dans la plénière, au fond","event_url":"https://www.meetup.com/GDG-Toulouse/events/228199310/","yes_rsvp_count":55,"announced":true,"name":"Témoignage de dév chez Payname, Fuite mémoire et Requêtes Http (Retrofit)","id":"228199310","time":"2016-02-24T18:00:00.000Z","updated":1456838641000,"group":{"join_mode":"open","created":1335779291000,"name":"GDG Toulouse","group_lon":1.4500000476837158,"id":3769052,"urlname":"GDG-Toulouse","group_lat":43.619998931884766,"who":"passionnés"},"status":"past"},{"utc_offset":7200000,"venue":{"country":"fr","localized_country_name":"France","city":"Toulouse","address_1":"40 Boulevard de la Marquette","name":"EPITECH","lon":1.429108,"id":24248807,"lat":43.612438,"repinned":false},"rsvp_limit":70,"headcount":0,"visibility":"public","waitlist_count":0,"created":1458864150000,"rating":{"count":1,"average":3},"maybe_rsvp_count":0,"description":"<p><a href=\"https://lh4.googleusercontent.com/_zy6SShsEJkwKtT17A9uB1us-FVwgazESDtlYIyGy_u7Nifiu3UWzqNWiHJbbcX49bu62L3Vg1PKmQL8eOXrrHJF4hRIJAzyGc6yQCB0B6U0eP4uKNqfcYyoRUA88hV8Ehs29HER\" class=\"linkified\">https://lh4.googleusercontent.com/_zy6SShsEJkwKtT17A9uB1us-FVwgazESDtlYIyGy_u7Nifiu3UWzqNWiHJbbcX49bu62L3Vg1PKmQL8eOXrrHJF4hRIJAzyGc6yQCB0B6U0eP4uKNqfcYyoRUA88hV8Ehs29HER</a></p> <p><br/>Avant les vacances de Paques, le TAUG vous propose une session avec la participation d’iBP.</p> <p><b>Sponsor</b></p> <p><a href=\"https://lh4.googleusercontent.com/jJGuRj-hcu-6ug_C8SRhu3nptVYJMXdn5PoA_qjH8ouisZx8PSM9V0oWufUel9_stgPci9ecmw1MeDRSSbsR7OtXyCyuIkqwgAPJSujOcbgSEhMvWGrhGLN0XPY1kWSXdW_zW9M4\" class=\"linkified\">https://lh4.googleusercontent.com/jJGuRj-hcu-6ug_C8SRhu3nptVYJMXdn5PoA_qjH8ouisZx8PSM9V0oWufUel9_stgPci9ecmw1MeDRSSbsR7OtXyCyuIkqwgAPJSujOcbgSEhMvWGrhGLN0XPY1kWSXdW_zW9M4</a></p> <p>Une présentation de la <b>Mobile Factory </b>des <b>Banque Populaire</b>, implenté à Toulouse, et des travaux qui y sont réalisés.</p> <p><br/><b>Lieu</b></p> <p><a href=\"https://lh3.googleusercontent.com/Y4-0T6d5p-p_if7IwRlCt0FvBMewelGSzWRffcgDcGls0PCUghdWL-sULZfqeWTIr4TezLgO8U1ZrwcKxz5Gnu5aSfNHiG6_rmuDsx7jXEwvzwrFreas0pLxX4JA_zZfniwq109x\" class=\"linkified\">https://lh3.googleusercontent.com/Y4-0T6d5p-p_if7IwRlCt0FvBMewelGSzWRffcgDcGls0PCUghdWL-sULZfqeWTIr4TezLgO8U1ZrwcKxz5Gnu5aSfNHiG6_rmuDsx7jXEwvzwrFreas0pLxX4JA_zZfniwq109x</a></p> <p>Merci a <b>Epitech </b>de nous accueillir sur le campus de la Marquette.</p> <p>\n\n<b>Contenu</b></p> <p><b>Développement sécurisé sous Android</b> par David Blanc (iBP)</p> <p><br/><img src=\"http://images.itnewsinfo.com/lmi/articles/originale/000000044619.png\" /></p> <p>\n\n\n<b>Android studio 2.0</b> par Baptiste Fallas (pictarine)</p> <p><br/><a href=\"https://lh6.googleusercontent.com/ONuXRcHI4uqDReZJ6cXA2tmygVoGg9spGNL3qJJLyvx8gYiIv_oMFOsWB2AkDzJQtkIZyhmE8x6CNBmCsekng-yN1vf3t7dkX-PkPvCWSxBq_MmMHN-hotK4_akvurnKiq788Lx3\" class=\"linkified\">https://lh6.googleusercontent.com/ONuXRcHI4uqDReZJ6cXA2tmygVoGg9spGNL3qJJLyvx8gYiIv_oMFOsWB2AkDzJQtkIZyhmE8x6CNBmCsekng-yN1vf3t7dkX-PkPvCWSxBq_MmMHN-hotK4_akvurnKiq788Lx3</a></p> <p><br/><b>Infos pratiques</b></p> <p>\n\n\n<a href=\"https://lh3.googleusercontent.com/Dva6d-LE0SFMadjsRgninrpI7I2mAcxbtZtsJjjGwRIdUuj9SAcraRTjHDBT5HhA1ZXdjZMTN8oQMzcqf-5JMED4q73eZ-KHD4PrOcJ5RQvB7pM7KYTxQlbMSU42rkPgQ3v6B9SF\" class=\"linkified\">https://lh3.googleusercontent.com/Dva6d-LE0SFMadjsRgninrpI7I2mAcxbtZtsJjjGwRIdUuj9SAcraRTjHDBT5HhA1ZXdjZMTN8oQMzcqf-5JMED4q73eZ-KHD4PrOcJ5RQvB7pM7KYTxQlbMSU42rkPgQ3v6B9SF</a></p> <p>\n\n\n<a href=\"https://goo.gl/maps/bPvbkffCjM92\">Métro: Ligne B - Canal du midi - Compans Caffarelli</a></p> <p><br/>Le code de l'entrée vous est envoyé par mail.</p> <p>Salle du 7ème étages</p>","event_url":"https://www.meetup.com/GDG-Toulouse/events/229853519/","yes_rsvp_count":56,"announced":true,"name":"La sécurité des applis Android et Android Studio 2.0","id":"229853519","time":"2016-04-13T17:00:00.000Z","updated":1460632072000,"group":{"join_mode":"open","created":1335779291000,"name":"GDG Toulouse","group_lon":1.4500000476837158,"id":3769052,"urlname":"GDG-Toulouse","group_lat":43.619998931884766,"who":"passionnés"},"status":"past"},{"utc_offset":7200000,"venue":{"country":"fr","localized_country_name":"France","city":"Toulouse","address_1":"14 Rue Claire Pauilhac","name":"E-artsup Toulouse","lon":1.445112,"id":24501560,"lat":43.611145,"repinned":false},"headcount":0,"visibility":"public","waitlist_count":0,"created":1460734923000,"rating":{"count":4,"average":5},"maybe_rsvp_count":0,"description":"<p>Comme l'année dernière, le Toulouse Android User Group retransmettra la Keynote de <b>Google IO</b>. Toutes les infos de l'événement à San Francisco sont ici : <a href=\"https://events.google.com/io2015\"><a href=\"https://events.google.com/io2016\" class=\"linkified\">https://events.google.com/io2016</a></a></p> <p>Google retransmet depuis plusieurs années <b>en direct</b> la keynote et la majorité des conférences via Youtube. Le <a href=\"https://developers.google.com/groups/\">réseau des GDGs</a> est là pour fédérer en local les développeurs qui veulent regarder ces retransmissions ensemble.</p> <p>Pour rendre tout cela le plus convivial possible et pour tenir la soirée, nous proposerons un repas accompagné de vins et  bières.</p> <p>Cet évènement est co-organisé avec l'école Epitech Toulouse qui fournira les boissons.</p> <p><br/><img src=\"http://photos3.meetupstatic.com/photos/event/3/e/f/a/600_341296122.jpeg\" /></p> <p>Merci également à E-artsup de nous accueillir.</p> <p><br/><img src=\"http://www.e-artsup.net/images/logo-e-artsup.png\" /></p> <p>Si vous souhaitez sponsoriser cette session, vous trouverez toutes les informations à cette adresse : </p> <p><a href=\"https://goo.gl/uifR4j\"><a href=\"https://goo.gl/uifR4j\" class=\"linkified\">https://goo.gl/uifR4j</a></a></p> <p>\n\n\n\n<a href=\"https://goo.gl/uifR4j\"><br/></a></p>","event_url":"https://www.meetup.com/GDG-Toulouse/events/230398590/","yes_rsvp_count":104,"announced":true,"name":"IO Extended 2016","id":"230398590","time":"2016-05-18T16:30:00.000Z","updated":1464012956000,"group":{"join_mode":"open","created":1335779291000,"name":"GDG Toulouse","group_lon":1.4500000476837158,"id":3769052,"urlname":"GDG-Toulouse","group_lat":43.619998931884766,"who":"passionnés"},"status":"past"},{"utc_offset":7200000,"venue":{"country":"fr","localized_country_name":"France","city":"Toulouse","phone":" 05 32 10 81 27 ","address_1":"27 Rue d'Aubuisson","name":"La Cantine","lon":1.454036,"id":11215992,"lat":43.602768,"repinned":false},"headcount":0,"visibility":"public","waitlist_count":0,"created":1464773964000,"rating":{"count":0,"average":0},"maybe_rsvp_count":0,"description":"<p>Bonjour à tous,</p> <p><br/>Voici le programme de la prochaine session :</p> <p><b>Contenu</b></p> <p>\n\nValentin Rocher : écosystème de Fabric (Crashlytics...)</p> <p><img src=\"http://images.techhive.com/images/article/2014/10/twitter-fabric-logo-100527200-primary.idge.jpg\" /></p> <p>\n\n\nMathias Seguy : Animate me if you don't do it for me do it for Chet</p> <p><img src=\"https://c1.staticflickr.com/9/8478/8286991185_17c0463c61_z.jpg\" /></p> <p><br/><b>Sponsor</b></p> <p>Nous n'avons pas de sponsor pour cette session, vous trouverez toutes les informations pour sponsoriser à cette adresse : <a href=\"https://goo.gl/uifR4j\"><a href=\"https://goo.gl/uifR4j\" class=\"linkified\">https://goo.gl/uifR4j</a></a></p> <p><br/><b>Lieu </b></p> <p>Merci à la Cantine de nous accueillir.<b><br/></b></p> <p><img src=\"http://photos2.meetupstatic.com/photos/event/2/4/f/3/600_446289459.jpeg\" /></p> <p>Adresse : 27 Rue d'Aubuisson, 31000 Toulouse</p> <p>\n\n<b>RAPPELS</b></p> <p>Rappelez-vous que nous proposons à toute entreprise de sponsoriser une session pour profiter de la communication de l'événement et de 10 minutes de discours libre en début de session.</p>","event_url":"https://www.meetup.com/GDG-Toulouse/events/231559033/","yes_rsvp_count":29,"announced":true,"name":"Mini Talks, Facebook messenger, Animations Android","id":"231559033","time":"2016-07-04T16:30:00.000Z","updated":1467663497000,"group":{"join_mode":"open","created":1335779291000,"name":"GDG Toulouse","group_lon":1.4500000476837158,"id":3769052,"urlname":"GDG-Toulouse","group_lat":43.619998931884766,"who":"passionnés"},"status":"past"},{"utc_offset":7200000,"venue":{"country":"fr","localized_country_name":"France","city":"Toulouse","address_1":"42 Port Saint-Étienne","name":"Le Seventies","lon":1.456638,"id":21126012,"lat":43.600479,"repinned":false},"headcount":0,"visibility":"public","waitlist_count":0,"created":1470894759000,"rating":{"count":0,"average":0},"maybe_rsvp_count":0,"description":"<p>Comme chaque été, l'apéro du Toulouse Android User Group est de retour !</p> <p>Tout le monde est convié, développeur ou pas, aficionados de Google ou pas, buveur de bière ou de diabolo : l'objectif est de se rencontrer dans un cadre moins formel et de d'échanger le temps d'un apéro.</p> <p>\n\n\nOn pourra parler des Google Cars, de Firebase mais aussi aborder un des évènements majeurs qui se tiendra début novembre : <a href=\"https://devfesttoulouse.fr/\">DevFest Toulouse 2016</a> ! Une première dans notre ville rose et où le TAUG est fortement impliqué.</p> <p><br/>Rendez-vous le mercredi 31 août au Seventies (métro F.Verdier) à partir de 19h.</p> <p><img src=\"https://a248.e.akamai.net/secure.meetupstatic.com/photos/event/9/0/1/8/600_440256888.jpeg\" /></p> <p><br/>N'hésitez à partager l'info sur Twitter, LoudR, Slack, Facebook, Snapchat ...</p> <p>\n\n\n\nA très vite !</p>","event_url":"https://www.meetup.com/GDG-Toulouse/events/233277927/","yes_rsvp_count":17,"announced":true,"name":"L'apéro d'été est de retour en Août !","id":"233277927","time":"2016-08-31T17:00:00.000Z","updated":1472676169000,"group":{"join_mode":"open","created":1335779291000,"name":"GDG Toulouse","group_lon":1.4500000476837158,"id":3769052,"urlname":"GDG-Toulouse","group_lat":43.619998931884766,"who":"passionnés"},"status":"past"},{"utc_offset":7200000,"venue":{"country":"fr","localized_country_name":"France","city":"Toulouse","address_1":"9 rue du Coq d'Inde","name":"AtHome","lon":1.44322,"id":24816505,"lat":43.599461,"repinned":false},"headcount":0,"visibility":"public","waitlist_count":0,"created":1475152756000,"rating":{"count":0,"average":0},"maybe_rsvp_count":0,"description":"<p>Bonjour à tous,</p> <p>Voici le programme de la prochaine session :</p> <p>\n\n\n• Jeremie Fourmann &amp; Martin d'Allens de Liberty Rider viendront nous faire une présentation de leur utilisation de Firebase.</p> <p><br/>• Julien Del Rio nous fera une revue des newsd Android Nougat.</p> <p><br/><img src=\"https://static.wixstatic.com/media/86e306_893b7afc03c64c54b27e48b685cec825~mv2.png/v1/fill/w_140,h_85,al_c,usm_0.66_1.00_0.01/86e306_893b7afc03c64c54b27e48b685cec825~mv2.png\" /></p> <p>\n\n\n<b>Lieu </b></p> <p>Merci à At Home de nous accueillir.</p> <p><img src=\"https://latho.me/wp-content/uploads/2015/10/version_vert_logo_png-300x188.png\" /></p> <p>Pour les plus motivés, à la fin de cette session nous irons prendre un verre dans un bar pas loin de chez At Home</p> <p>\n\n\n\n<b>Sponsor</b></p> <p>Nous n'avons pas de sponsor pour cette session, vous trouverez toutes les informations pour sponsoriser à cette adresse : <a href=\"https://goo.gl/uifR4j\"><a href=\"https://goo.gl/uifR4j\" class=\"linkified\">https://goo.gl/uifR4j</a></a></p>","event_url":"https://www.meetup.com/GDG-Toulouse/events/234499094/","yes_rsvp_count":48,"announced":true,"name":"Présentation de Firebase et news Android Nougat","id":"234499094","time":"2016-10-12T17:00:00.000Z","updated":1476304755000,"group":{"join_mode":"open","created":1335779291000,"name":"GDG Toulouse","group_lon":1.4500000476837158,"id":3769052,"urlname":"GDG-Toulouse","group_lat":43.619998931884766,"who":"passionnés"},"status":"past"},{"utc_offset":3600000,"venue":{"country":"fr","localized_country_name":"France","city":"Toulouse","address_1":"13 rue Sainte Ursule","name":"HarryCow Coworking","lon":1.442048,"id":24605620,"lat":43.602219,"repinned":false},"rsvp_limit":80,"headcount":0,"visibility":"public","waitlist_count":0,"created":1478074777000,"rating":{"count":6,"average":5},"maybe_rsvp_count":0,"description":"<p>Dernière session de l’année !</p> <p><br/>Au programme deux conférences, estampillées \"Clean Code\", consacrées aux <b>tests </b>sous Android et à leurs mise en oeuvre.</p> <p><img src=\"https://a248.e.akamai.net/secure.meetupstatic.com/photos/event/7/e/5/8/600_455972344.jpeg\" /></p> <p>\n\n\n<b>Conferences</b></p> <p>• <b>Romain Mouton : Android architecture : MVP vs MVVM (databinding)</b></p> <p>Les fragments et les activités sont souvent des classes à tout faire. Récupérer des données, traiter des données et enfin afficher des données... Et la maintenabilité ? Et les tests ?</p> <p><br/>Regardons ensemble deux patterns d'architecture : MVP et MVVM (avec databinding) pour avoir moins de couplage, plus de lisibilité et ENFIN pouvoir faire des tests facilement sous Android!</p> <p>• <b>Guilhem de Miollis : Du premier test au PushDelivery</b></p> <p>“Tester, ça prends du temps”</p> <p>“L’architecture ne le permet pas”</p> <p>“C’est compliqué à mettre en place”</p> <p>“C’est encore plus de code à maintenir”</p> <p>On a tous entendu ça. Même si ces affirmations se vérifient sur le court terme, il en est autrement sur le long terme. Ensemble nous allons voir s’il est nécessaire d’écrire des tests, quel sera votre premier test et comment l’écrire, comment savoir si mon application est bien testée jusqu’à pouvoir automatiser son déploiement sur le store à partir d’un simple push sur la branche Master.</p> <p>\n\n\n\n<b>Lieu</b></p> <p><br/>On remercie HarryCow de nous accueillir.</p> <p>c'est au 13 rue Sainte Ursule, Toulouse, entre Esquirol et Capitole. Rdv à partir de <b>19h</b>.</p> <p>\n\n\n<b>Sponsor</b></p> <p>Nous n'avons pas de sponsor pour cette session, vous trouverez toutes les informations pour sponsoriser à cette adresse : <a href=\"https://goo.gl/uifR4j\"><a href=\"https://goo.gl/uifR4j\" class=\"linkified\">https://goo.gl/uifR4j</a></a></p>","event_url":"https://www.meetup.com/GDG-Toulouse/events/235289342/","yes_rsvp_count":56,"announced":true,"name":"Android et les tests","id":"235289342","time":"2016-11-30T18:00:00.000Z","updated":1481112284000,"group":{"join_mode":"open","created":1335779291000,"name":"GDG Toulouse","group_lon":1.4500000476837158,"id":3769052,"urlname":"GDG-Toulouse","group_lat":43.619998931884766,"who":"passionnés"},"status":"past"},{"utc_offset":3600000,"venue":{"country":"fr","localized_country_name":"France","city":"Toulouse","address_1":"32 Rue des Marchands","name":"AtHome","lon":1.443144,"id":25011276,"lat":43.599892,"repinned":false},"rsvp_limit":80,"headcount":0,"visibility":"public","waitlist_count":0,"created":1483348930000,"rating":{"count":3,"average":5},"maybe_rsvp_count":0,"description":"<p>Bonne année les amis !</p> <p>Pour le premier meetup de l'année 2017, on fait un premier meetup du GDG Toulouse ! Ne vous inquiétez pas, on a déjà des meetups Angular Toulouse et TAUG dans la manche ;)</p> <p><b>Demandez le programme</b></p> <p>Pour ce premier meetup, nous vous proposons un programme de top qualité :</p> <p><i>Top 10 des news Google Cloud - Alexis Moussine-Pouchkine</i></p> <p><br/>Alexis, Google Cloud Developer Relations chez Google, va vous faire découvrir les dernières annonces en date pour la plateforme Cloud de Google.</p> <p><br/><img src=\"http://photos4.meetupstatic.com/photos/event/5/a/9/9/600_457223193.jpeg\" /></p> <p><i>Dart in Production &amp; AngularDart - Boris-Wilfried Nyasse </i></p> <p><br/>Boris-Wilfried (<a href=\"https://github.com/bwnyasse\">@bwnyasse</a>), Agile DevOps, vous proposera le contenu suivant :</p> <p>• <a href=\"https://www.dartlang.org/\">Dart</a> est un language de programmation développé par Google. Où en est il aujourd'hui ?</p> <p>• Le célèbre framework Angular rencontre Dart pour donner <a href=\"https://webdev.dartlang.org/angular/quickstart?utm_campaign=dart_migration&amp;utm_medium=redirect&amp;utm_source=angular.io\">AngularDart</a>. Qu'en est-il de cette variante ?</p> <p>• Pouvons nous utiliser nos librairies Javascript si nous choisissons Dart pour un projet ?</p> <p><img src=\"http://photos4.meetupstatic.com/photos/event/5/a/a/0/600_457223200.jpeg\" /></p> <p><b>Avec le soutien de </b></p> <p>Les bières vous seront offertes par notre sponsor du soir Toptal.</p> <p><a href=\"https://www.toptal.com/#select-just-supreme-hackers\">Toptal</a> est un réseau de top freelances à travers le monde. Toptal s'adresse aux top entreprises pour leurs meilleurs projets.</p> <p><img src=\"http://photos4.meetupstatic.com/photos/event/5/a/a/3/600_457223203.jpeg\" /></p> <p>Vous voulez sponsoriser un événement ? Contactez-notre équipe.</p> <p><b>On s'donne rendez vous ?</b></p> <p>Nous vous attendrons dès 19h00 chez <a href=\"http://l.facebook.com/l.php?u=http%3A%2F%2Fathome-startup.fr%2F&amp;h=wAQEegxK3&amp;enc=AZMahDAnEBrdP3rM14-Yca8bsLpccXRYAmTxKCxYrDjVvFUlNfYneMlMdiDT4eFb-fAdTWpktB5DXN-fZ4ear1X491Vqdn4WVlkvStQIX1YkZzktBJLfywknUhFSoyPAc2s6rTCcYsHzwpSEDJeuzRR7i4WQyfs-cA2PkHQURCm4SCtq4kpaKGyZP2R12ug2QCF5cAA87K0C_6ozdEZYBE7W8amMo00HEn3uciEyrp4VhmB0jh65eRFUq3NAd7apihORdRF3yOKcOn4wqU0NxObhAnRyzgzwbMipG_rZmWBTKiqA1Y7uqrFXI19RJtN75HHau7hdhWDWNyZNEw--CCr_tWZ6wYrsqDtli1Ij0r2V_Z4O2HitX4k2jpffYASTjwyhFJXAC7-ksMkwMLPsj89PwAB-_vA8mYbupQjCwzgEusx4rorh4Rx4RIIpr-mJxeY&amp;s=1\">AtHome</a> (exceptionnellement l'entree ce fera 32 Rue des Marchands), le modèle unique d’innovation, alliant ouverture et performance pour la croissance des startups.</p>","event_url":"https://www.meetup.com/GDG-Toulouse/events/236603280/","yes_rsvp_count":79,"duration":14400000,"announced":true,"name":"GDG : S01E01 Google Cloud Platform et Dart","id":"236603280","time":"2017-01-26T18:00:00.000Z","updated":1487000070000,"group":{"join_mode":"open","created":1335779291000,"name":"GDG Toulouse","group_lon":1.4500000476837158,"id":3769052,"urlname":"GDG-Toulouse","group_lat":43.619998931884766,"who":"passionnés"},"status":"past"},{"utc_offset":3600000,"venue":{"country":"fr","localized_country_name":"France","city":"Toulouse","address_1":"9 rue du Coq d'Inde","name":"AtHome","lon":1.44322,"id":24816505,"lat":43.599461,"repinned":false},"rsvp_limit":90,"headcount":0,"visibility":"public","waitlist_count":0,"created":1485529533000,"rating":{"count":10,"average":4.900000095367432},"maybe_rsvp_count":0,"description":"<p><b>Angular 2 et la programmation réactive</b></p> <p><i>Par Bruno Baia</i></p> <p>Angular 2 adopte les Observables et la programmation Reactive. Apprenez ce qu'est un Observable et comment Angular 2 les utilise pour créer des applications avec une expérience utilisateur optimale.</p> <p><br/><b>Web Components : Comment Angular nous permet de construire le futur des applications web</b></p> <p><i>Par Amadou Sall, Développeur Frontend chez Air France</i></p> <p>Les Web Components sont un ensemble de quatre spécifications (Templates, Shadow DOM, Custom Elements, HTML imports). Ils nous permettent de résoudre beaucoup de problèmes du web traditionnel notamment les conflits de styles CSS et le manque d'expressivité des balises HTML.</p> <p>Cependant leurs utilisations de façon brute dans le web d'aujourd'hui est un peu compliqué et rend l'adoption des Web Components lente.<br/>Heureusement des frameworks comme Angular sont là pour nous aider à prendre de l'avance en nous fournissant des mécanismes nous permettant de développer des applications web respectant les spécifications des Web Components.</p> <p>Dans ce talk, nous allons tout d'abord voir les problèmes posés par le web traditionnel.<br/>Nous allons ensuite parler des spécifications des Web Components et comment elles aident à résoudre ces problèmes.<br/>Nous finirons par voir la place de Angular dans ce nouveau paradigme</p>","event_url":"https://www.meetup.com/GDG-Toulouse/events/237243130/","yes_rsvp_count":83,"announced":true,"name":"GDG Angular: S01E02 Programmation Réactive & Web Components","id":"237243130","time":"2017-02-23T18:00:00.000Z","updated":1487940863000,"group":{"join_mode":"open","created":1335779291000,"name":"GDG Toulouse","group_lon":1.4500000476837158,"id":3769052,"urlname":"GDG-Toulouse","group_lat":43.619998931884766,"who":"passionnés"},"status":"past"},{"utc_offset":3600000,"venue":{"country":"fr","localized_country_name":"France","city":"Toulouse","address_1":"9 rue du Coq d'Inde","name":"AtHome","lon":1.44322,"id":24816505,"lat":43.599461,"repinned":false},"rsvp_limit":80,"headcount":0,"visibility":"public","waitlist_count":0,"created":1486550051000,"rating":{"count":0,"average":0},"maybe_rsvp_count":0,"description":"<p>Vous connaissez surement Google IO ! Ben, Google Cloud Next c'est le Google IO de toute l'offre Cloud de Google, autant dire, il y a du matos.</p> <p><img src=\"http://photos4.meetupstatic.com/photos/event/3/f/d/b/600_458176347.jpeg\" /></p> <p>Alison Wagonfeld,VP of Google Cloud marketing, tease de la faàon suivante : “We’ll kick things off on March 8 with keynotes featuring the Google Cloud leadership team, new product announcements and demonstrations and perspectives from industry leaders.”.</p> <p>Si vous vous demandez ce qui a été annoncé l'année dernière pour vous mettre l'eau à la bouche, la keynote de <a href=\"https://www.youtube.com/watch?v=HgWHeT_OwHc\">l'année dernière est en ligne</a>.</p> <p>L'event aura lieu à San Francisco et sera évidemment introduit par une Keynote. C'est cette Keynote que nous vous proposons de retransmettre.</p> <p><img src=\"http://photos2.meetupstatic.com/photos/event/4/0/b/0/600_458176560.jpeg\" /></p> <p>Nous vous donnons donc rendez vous un peu avant 18h pour être prêts pour le lancement.</p> <p>Nous attendons confirmation pour le lieu, et nous ouvrirons les inscriptions dès que nous aurons confirmation. Mais vous pouvez déjà mettre une croix dans votre emploi du temps.</p> <p>Nous fournirons quelques bières pour débrieffer après le live stream ;)</p>","event_url":"https://www.meetup.com/GDG-Toulouse/events/237548894/","yes_rsvp_count":22,"announced":true,"name":"[Hors-série] Retransmission Google Cloud Next 2017","id":"237548894","time":"2017-03-08T16:45:00.000Z","updated":1489004595000,"group":{"join_mode":"open","created":1335779291000,"name":"GDG Toulouse","group_lon":1.4500000476837158,"id":3769052,"urlname":"GDG-Toulouse","group_lat":43.619998931884766,"who":"passionnés"},"status":"past"},{"utc_offset":3600000,"venue":{"country":"fr","localized_country_name":"France","city":"Toulouse","address_1":"13 rue Sainte Ursule","name":"HarryCow Coworking","lon":1.442048,"id":24605620,"lat":43.602219,"repinned":false},"rsvp_limit":100,"headcount":0,"visibility":"public","waitlist_count":0,"created":1486746641000,"rating":{"count":1,"average":5},"maybe_rsvp_count":0,"description":"<p><b>Introduction à Android Things</b></p> <p><i>Par Marc Plano-Lesay</i></p> <p>Introduction à Android Things : qu'est-ce que c'est, de quoi c'est composé, comment ça s'utilise, à quoi ça peut servir…</p> <p><br/><b><br/></b></p> <p><b>Devops Android</b></p> <p><i>Par Guilhem de Miollis </i></p> <p>\"Comment automatiser tout ce qui peut être automatisable.</p> <p>Capture d'écran automatique avec Screengrab.</p> <p>Plugin Android studio pour déployer automatiquement sur le store avec mise à jour de la fiche de l'application</p> <p>Comment réduire la taille de son APK quand on doit intégrer une librairie native?</p> <p>Tâches gradle custom\"</p>","event_url":"https://www.meetup.com/GDG-Toulouse/events/237613975/","yes_rsvp_count":91,"announced":true,"name":"GDG Android: S01E03 Introduction à Android Things & Devops Android","id":"237613975","time":"2017-03-16T18:00:00.000Z","updated":1489700313000,"group":{"join_mode":"open","created":1335779291000,"name":"GDG Toulouse","group_lon":1.4500000476837158,"id":3769052,"urlname":"GDG-Toulouse","group_lat":43.619998931884766,"who":"passionnés"},"status":"past"},{"utc_offset":7200000,"venue":{"country":"fr","localized_country_name":"France","city":"Toulouse","address_1":"1 Place de la Bourse (Métro Esquirol)","name":"Wild Code School","lon":1.443834,"id":25100458,"lat":43.60025,"repinned":false},"rsvp_limit":25,"headcount":0,"visibility":"public","waitlist_count":0,"created":1489159038000,"rating":{"count":1,"average":5},"maybe_rsvp_count":0,"description":"<p><b>Présence obligatoire (places limitées à 25 participants)</b></p> <p><br/>Tu es développeur <b>Java / JS</b> ? Viens tester tes automatismes et te mesurer à d'autres dévs sur un Dojo ludique avec un thème surprise!</p> <p>- 19h : Début des Dojos</p> <p>- 20h30 : Apéro et échanges</p> <p><b>Le concept : </b></p> <p><br/>Le Dojo vient à l'origine des sports de combat. Le Dojo est le lieu où l'on pratique des katas c'est à dire des mouvements ou série de mouvements qui sont répétés tant de fois qu'ils en deviennent automatiques.<br/>Depuis plusieurs années, l'exercice du Dojo a été repris dans l'univers de la programmation informatique et pratiqué par des groupes de développeurs qui se réunissent et progressent de façon collaborative pour la résolution de problèmes algorithmiques en groupe.</p> <p>Un Dojo dure environ une heure et demie et réunit des petits groupes de 5 à 7 développeurs sur des technos et des niveaux variables.</p> <p><b>Merci à la Wild Code School d'animer et d'accueillir cet événement!</b></p> <p><br/><b><br/></b></p> <p><img src=\"https://a248.e.akamai.net/secure.meetupstatic.com/photos/event/a/b/d/d/600_458983997.jpeg\" /></p> <p><b><br/></b></p> <p>La <a href=\"http://wildcodeschool.fr\">Wild Code School</a> est une école nouvelle génération dont l’objectif est de combler le défaut de compétences numériques en formant des développeurs à portée des entreprises en quête de talents. Les élèves de la Wild Code School forment une communauté soudée qui s’appuie sur l’entraide et le soutien mutuel. La joie de vivre et la passion font partie de notre quotidien.</p>","event_url":"https://www.meetup.com/GDG-Toulouse/events/238318125/","yes_rsvp_count":23,"announced":true,"name":"[DOJO JS/JAVA] avec la Wild Code School","id":"238318125","time":"2017-04-06T16:45:00.000Z","updated":1491552223000,"group":{"join_mode":"open","created":1335779291000,"name":"GDG Toulouse","group_lon":1.4500000476837158,"id":3769052,"urlname":"GDG-Toulouse","group_lat":43.619998931884766,"who":"passionnés"},"status":"past"},{"utc_offset":7200000,"venue":{"country":"fr","localized_country_name":"France","city":"Toulouse","address_1":"13 rue Sainte Ursule","name":"HarryCow Coworking","lon":1.442048,"id":24605620,"lat":43.602219,"repinned":false},"rsvp_limit":90,"headcount":0,"visibility":"public","waitlist_count":0,"created":1488211005000,"rating":{"count":3,"average":5},"maybe_rsvp_count":0,"description":"<p>Cet événement est organisé avec nos amis du <a href=\"http://toulousejs.francejs.org/\">ToulouseJS</a>!</p> <p><br/><b>React Native : quoi, pourquoi, comment, pour qui ?</b></p> <p><br/><i>Par Damien Brugne <a href=\"https://twitter.com/dbrugne\">@dbrugne</a>,Javascript enthousiaste<br/></i></p> <p>React Native a introduit un nouveau paradigme dans l'industrie du développement mobile. Qu'est ce que ça veut dire ? A quel point c'est vrai ? Quels apps sont concernées ?</p> <p>Niveau de difficulté : débutant</p> <p><br/>---</p> <p><b>Comment séparer ses composants React ?</b></p> <p><i>Par Julien Pradet <a href=\"https://twitter.com/JulienPradet\">@JulienPradet</a>, Développeur web @occitech</i></p> <p>Quand on parle React, on dit souvent qu'il faut faire une séparation entre les composants Dumbs et les composants Smart. Qu'est ce que ça veut dire ? Est-ce que ça suffit pour réutiliser facilement nos composants ? Est-ce qu'on ne risque pas de duppliquer le code propre à l'UI ?</p> <p><br/>Pour répondre à ces questions, on essayera d'identifier les pièges à éviter afin d'en dégager quelques bonnes pratiques. Puis, on regardera comment React Storybook peut nous aider dans cette tâche.</p> <p>Niveau de difficulté : débutant</p>","event_url":"https://www.meetup.com/GDG-Toulouse/events/238029328/","yes_rsvp_count":87,"announced":true,"name":"GDG React: S01E04","id":"238029328","time":"2017-04-19T16:45:00.000Z","updated":1493392069000,"group":{"join_mode":"open","created":1335779291000,"name":"GDG Toulouse","group_lon":1.4500000476837158,"id":3769052,"urlname":"GDG-Toulouse","group_lat":43.619998931884766,"who":"passionnés"},"status":"past"},{"utc_offset":7200000,"venue":{"country":"fr","localized_country_name":"France","city":"Toulouse","address_1":"40 Boulevard de la Marquette","name":"EPITECH","lon":1.429108,"id":24248807,"lat":43.612438,"repinned":false},"rsvp_limit":100,"headcount":0,"visibility":"public","waitlist_count":0,"created":1489398940000,"rating":{"count":0,"average":0},"maybe_rsvp_count":0,"description":"<p>Comme l'année dernière, le Toulouse Android User Group retransmettra la Keynote de <b>Google IO</b>. Toutes les infos de l'événement à San Francisco sont ici : <a href=\"https://events.google.com/io/extended/\"><a href=\"https://events.google.com/io/extended/\" class=\"linkified\">https://events.google.com/io/extended/</a> </a></p> <p><br/>Google retransmet depuis plusieurs années <b>en direct</b> la keynote et la majorité des conférences via Youtube. Le <a href=\"https://developers.google.com/groups/\">réseau des GDGs</a> est là pour fédérer en local les développeurs qui veulent regarder ces retransmissions ensemble.</p> <p>Pour rendre tout cela le plus convivial possible et pour tenir la soirée, nous proposerons un repas.</p>","event_url":"https://www.meetup.com/GDG-Toulouse/events/238379825/","yes_rsvp_count":84,"announced":true,"name":"[Hors-série] Google I/O Extended 2017","id":"238379825","time":"2017-05-17T16:30:00.000Z","updated":1495052931000,"group":{"join_mode":"open","created":1335779291000,"name":"GDG Toulouse","group_lon":1.4500000476837158,"id":3769052,"urlname":"GDG-Toulouse","group_lat":43.619998931884766,"who":"passionnés"},"status":"past"},{"utc_offset":7200000,"venue":{"country":"fr","localized_country_name":"France","city":"Toulouse","address_1":"13 rue Sainte Ursule","name":"HarryCow Coworking","lon":1.442048,"id":24605620,"lat":43.602219,"repinned":false},"rsvp_limit":100,"headcount":0,"visibility":"public","waitlist_count":0,"created":1494927991000,"rating":{"count":0,"average":0},"maybe_rsvp_count":0,"description":"<p>Pour cette session du GDG nous vous proposons de découvrir les nouveaux langages que sont Kotlin et Swift. </p> <p><b>De Java à Swift ou Kotlin<br/></b></p> <p><i>par Didier Plaindoux et Emmanuel Vinas</i><b><i><br/></i></b></p> <p>Java est un langage qui a fait ses preuves depuis pas mal d'année et de ce fait de nombreux développeurs connaissent ce langage. On verra lors de cette présentation comment passer du langage java à Kotlin ou Swift. Ca nous permettra également de voir que ces deux nouveaux langages ne sont pas si éloignés. <b><br/></b></p> <p>Niveau de difficulté<b>: débutant</b></p> <p><b><br/></b></p> <p><b>Migration d’une application Android de Java vers Kotlin en live coding</b></p> <p>par Arnaud Giuliani et Laurent Baresse</p> <p>Nous allons partir d’une application Android Météo écrite en Java.<br/>Au fil de la session, nous allons la migrer pas à pas de Java vers Kotlin afin de démontrer par l’exemple et progressivement le pouvoir d’expression de Kotlin pour les développeurs Android.</p> <p>Nous illustrerons les concepts tels que :</p> <p>les collections Kotlin</p> <p>les lambdas</p> <p>null safety et les optionalles</p> <p><br/>string templates</p> <p>kotlin-android-extensions</p> <p>les data classesles type extensions...</p> <p>\n\n\nL’objectif de cette session n’est pas focalisé sur une restitution d’un retour d’expérience mais plutôt sur le fait de montrer en live comment se déroule une séance de migration de code Java vers Kotlin afin d’encourager les participants à se lancer sur leurs projets et d’en tirer tout le bénéfice. Nous pourrons néanmoins aborder les retours d’expériences lors des questions.</p> <p><br/>Niveau de difficulté<b>: intermédiaire</b></p>","event_url":"https://www.meetup.com/GDG-Toulouse/events/240024489/","yes_rsvp_count":64,"announced":true,"name":"GDG Kotlin & Swift: S01E05","id":"240024489","time":"2017-06-08T17:00:00.000Z","updated":1496953850000,"group":{"join_mode":"open","created":1335779291000,"name":"GDG Toulouse","group_lon":1.4500000476837158,"id":3769052,"urlname":"GDG-Toulouse","group_lat":43.619998931884766,"who":"passionnés"},"status":"past"},{"utc_offset":7200000,"venue":{"country":"fr","localized_country_name":"France","city":"Toulouse","address_1":"13 rue Sainte Ursule","name":"HarryCow Coworking","lon":1.442048,"id":24605620,"lat":43.602219,"repinned":false},"headcount":0,"visibility":"public","waitlist_count":0,"created":1494341709000,"rating":{"count":1,"average":4},"maybe_rsvp_count":0,"description":"<p><b>Industrialiser votre librairie Angular en moins de 10 minutes </b></p> <p><br/><i>par Philippe Beroucry <a href=\"https://twitter.com/philou_philou_p\">@philou_philou_p</a>, Développeur iBP</i></p> <p>Au travers de l'objectif de la présentation, nous allons voir comment générer une librairie Angular pouvant fonctionner en mode AOT avec du lazy loading également.<br/>Dans la cadre de ma mission actuelle, nous avons développer une stratégie de développement qui pourraient intéresser la communauté.<br/>Nous allons également voir l'ensemble d'un circuit d'intégration continue avec du jenkins ainsi que du docker.</p> <p>Niveau de difficulté: <b>avancé</b></p> <p>---</p> <p><b>Lazy Loading en Just Angular : Aïe ?</b></p> <p>par Igor Laborie <a href=\"https://twitter.com/ilaborie\">@ilaborie</a>, 'Expert' Web &amp; Java chez MonkeyPatch</p> <p>Live-coding pour expliquer comment on peut faire du lazy-loading dans Angular.</p> <p>Niveau de difficulté: <b>débutant/avancé</b></p>","event_url":"https://www.meetup.com/GDG-Toulouse/events/239849554/","yes_rsvp_count":78,"announced":true,"name":"GDG Angular: S01E06","id":"239849554","time":"2017-06-27T16:45:00.000Z","updated":1498594378000,"group":{"join_mode":"open","created":1335779291000,"name":"GDG Toulouse","group_lon":1.4500000476837158,"id":3769052,"urlname":"GDG-Toulouse","group_lat":43.619998931884766,"who":"passionnés"},"status":"past"},{"utc_offset":7200000,"venue":{"country":"fr","localized_country_name":"France","city":"Toulouse","address_1":"100 Rue Riquet","name":"Rooster & Beer","lon":1.454023,"id":25328115,"lat":43.608501,"repinned":false},"rsvp_limit":100,"headcount":0,"visibility":"public","waitlist_count":0,"created":1498228396000,"rating":{"count":3,"average":5},"maybe_rsvp_count":0,"description":"<p>Pour fêter la fin de la saison des meetups, l'arrivée de l'été et les 800+ membres sur le <a href=\"http://communautes-toulouse.herokuapp.com/\">Slack des communautes Toulousaines</a> nous organisons un apero en centre ville.</p> <p>Le bar <a href=\"https://www.facebook.com/roosterandbeer/\">Rooster &amp; Beer</a> nous privatise une salle et nous propose le tarif Happy Hour pour toute la soiree.</p>","event_url":"https://www.meetup.com/GDG-Toulouse/events/241019790/","yes_rsvp_count":28,"announced":true,"name":"Apéro Slack","id":"241019790","time":"2017-07-04T17:00:00.000Z","updated":1499250145000,"group":{"join_mode":"open","created":1335779291000,"name":"GDG Toulouse","group_lon":1.4500000476837158,"id":3769052,"urlname":"GDG-Toulouse","group_lat":43.619998931884766,"who":"passionnés"},"status":"past"}]
